{"215": {"website": "http://www.usabiltiyworks.net", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "danachis", "time": "14:45:00", "period": "", "entry_id": "215", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["While the Web has evolved from flat documents to being fluidly ambient, we&rsquo;re using the same user research and usability testing methods and techniques we were using in 1994. We know that conducting usability tests can tell us where people get frustrated. What will testing reveal about frustrations with interactions people have with other people online? When interaction is protean, how do you derive a task scenario? What are the success criteria? When you have large-scale social, individual workarounds turn into functionality and social norms. Etiquette evolves organically. What&rsquo;s that test look like? In this session, Dana will boil these questions down to 5 major issues UXers working in the social Web are grappling with and share experiences from pioneering researchers."], "last": "Chisnell", "name": "", "room": "Liffey B", "gender": "F", "length": "45", "theme": "Theory", "country": "us", "organization": "UsabilityWorks", "session_title": "Real users don't do tasks: Rethinking user research for the social Web", "first": "Dana", "add_class": "", "job_title": "Researcher"}, "210": {"full_name_two": "", "name_two": "Mr.", "suffix": "", "twitter": "medicalavatar", "period": "", "entry_id": "210", "sponsor": "", "another": "Yes", "job_title_two": "Co-Founder", "first_two": "Akshay", "last_two": "Kapur", "country_two": "us", "email_two": "akshay@medicalavatar.com", "theme": "Strategy", "session_title": "The Future of Design, Healthcare, and Mobile Technology", "add_class": "", "job_title": "Co-Founder", "website": "http://medicalavatar.com", "description": ["Mobile technologies are having a transformative impact on both healthcare access and delivery. The interaction design of a given product for healthcare may have actual life or death consequences. This presentation will highlight key examples of innovative designs for new smart phone and tablet software that helps people manage chronic diseases, quantify their health status, and connect to critical medical resources via remote health monitoring. Benefits of good health technology design for both clinicians and patients include better informed decision-making processes and efficiencies gained through well-organized and aggregated data sets.", "Learning objectives include:", " &bull; How to create powerful design processes to solve complex problems in medicine and healthcare.", " &bull; How designers can best shape technologies to empower patients, physicians, and researchers.", " &bull; How to effectively present modular, complicated, variable and voluminous data on mobile computing platforms.", "Emerging designs that are serving as stepping stones in the convergence of healthcare and health information technology will be discussed. The presentation will include live demonstrations of outstanding mobile healthcare app designs and other new technologies being used by both patients and clinicians. The importance of interaction design will be emphasized in its critical role for bringing the benefits of mobile technologies to doctors, patients and the overall health care community."], "session_type": "presentation", "time": "13:45:00", "twitter_two": "medicalavatar", "date": "2012-02-02", "suffix_two": "", "room": "Liffey 2", "last": "Wong", "name": "Mr.", "gender": "M", "website_two": "http://medicalavatar.com", "length": "45", "status": "accepted", "gender_two": "M", "biography_two": "As the EHR implementation expert for Weill Cornell Medical College and UBMD, a 500-physician practice group, Akshay Kapur transitioned 17 individual medical practices from paper to electronic systems in the last 6 years. He increased efficiency in all aspects of the medical practice using the EHR, enhanced physician interaction with patients in and out of the office, and improved quality of care through data trending and medical error alerts. Akshay’s implementation and managerial expertise led to revenue increases upwards of $2-$4 million per practice, reduced physician documentation time by 32%, and improved patient satisfaction ratings from 70% to over 90%.", "organization": "Medical Avatar", "country": "us", "organization_two": "Medical Avatar", "first": "Virgil"}, "135": {"website": "http://www.luminanze.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "ebuie", "time": "13:55:00", "period": "", "entry_id": "135", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["The human spirit is the part of us that feels a sense of deep connection with something larger than ourselves — whether it be nature, a deity or other being, a group of people, a cause, or the Universe. Our use of technology may foster such a sense of connection — or work to its detriment. I will tell three stories from my own experience, two as a user of technology and one as a professional doing UX work. I will invite the audience to share their own stories with me afterwards.", "UX is work of the human spirit."], "last": "Buie", "name": "Ms.", "room": "Liffey 1", "gender": "F", "length": "10", "theme": "Aesthetics", "country": "us", "organization": "Luminanze Consulting", "session_title": "UX and the Human Spirit: Three Stories of Connection", "first": "Elizabeth", "add_class": "", "job_title": "Principal Consultant"}, "25": {"website": "http://www.thinktiv.com", "status": "sold-out", "suffix": "", "session_type": "workshop", "twitter": "jkolko", "time": "13:30:00", "period": "Afternoon", "entry_id": "25", "sponsor": "", "another": "No", "date": "2012-02-01", "description": ["User-centered design research activities produce an enormous quantity of raw data, which must be systematically and rigorously analyzed in order to extract meaning and insight. Unfortunately, these methods of analysis are poorly documented and rarely taught, and because of the pragmatic time constraints associated with working with clients, there is often no time dedicated in a statement of work to a practice of formal synthesis. As a result, raw design research data is inappropriately positioned as insight, and the value of user-centered research activities is marginalized &#8211; in fact, stakeholders may lose faith in the entire research practice, as they don&rsquo;t see direct return on the investment of research activities.", "Design synthesis methods can be taught, and when selectively applied, visual, diagrammatic synthesis techniques can be completed relatively quickly. During Synthesis, Designers visually explore large quantities of data in an effort to find and understand hidden relationships. These visualizations can then be used to communicate to other members of a design team, or can be used as platforms for the creation of generative sketching or model making. The action of diagramming is a way to actively produce knowledge and meaning.", "This workshop will introduce various methods of Synthesis as ways to translate research into meaningful insights. Workshop participants will learn about how to manage the complexity of gathered data, and through hands-on exercises, they will apply various synthesis methods to elicit hidden meaning in gathered data.", "This hands-on approach is critical for building both confidence and ability with the various synthesis methods that are discussed.", "As a result of completing this workshop, attendees will:", " &bull; Understand how synthesis fits into the larger design process", " &bull; Understand the theoretical underpinnings of design synthesis as an intellectual problem solving methodology", " &bull; Be able to apply specific methods of synthesis in their respective careers", "This workshop is best suited for between twenty and sixty participants. Participants should be familiar with either qualitative or quantitative research activities (such as ethnography, questionnaires and surveys, contextual inquiry, etc), and will likely hold jobs relating to research, usability, design, &ldquo;UX&rdquo;, or marketing. No Design Synthesis experience is required."], "last": "Kolko", "name": "Mr.", "room": "C038", "gender": "M", "length": "180", "theme": "Process", "country": "us", "organization": "Thinktiv, Austin Center for Design", "session_title": "Methods of Design Synthesis", "first": "Jon", "add_class": "", "job_title": "Executive Director"}, "UXBC": {"status": "approved", "room": "Liffey A/B", "session_type": "activity", "theme": "", "length": "80", "entry_id": "UXBC", "sponsor": "", "time": "12:40:00", "date": "2012-02-03", "session_title": "Lunch: UX Book Club", "description": [""]}, "289": {"website": "", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "hitsmachines", "time": "14:00:00", "period": "", "entry_id": "289", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["The DNA of our industry is rapidly evolving. Devices are multiplying like a zombie plague; once immutable patterns are being challenged; interface conventions are changing at an incredible pace; all the while, our documentation is struggling to stay relevant. This constant flux is enough to make you want to quit and buy a farm. But one thing remains constant through it all: user experiences are forged in code. As UX professionals, we are learning, unlearning, and relearning things all the time. We do it to understand the needs of our users, keep abreast of changes in our field, and communicate effectively with our clients. Understanding code is no different. Whether you are wrangling big data, making objects smarter, or trying to design a more intuitive mobile interface, code literacy is an invaluable design skill. At last year&rsquo;s conference, there was much discussion about what the material or medium of our profession is. This talk will explore the ways in which code is becoming more and more critical to the experiences we are designing, and present you with a framework that you can apply to your own practice to increase your code literacy.", "\"The illiterate of the 21st century will not be those who cannot read and write, but those who cannot learn, unlearn, and relearn.\"", " &#8212; Alvin Toffler, Rethinking the Future"], "last": "Betts", "name": "Mr.", "room": "Liffey 2", "gender": "M", "length": "10", "theme": "Process", "country": "ca", "organization": "Nitobi Software Inc.", "session_title": "Concept to code: Code literacy in UX", "first": "Ryan", "add_class": "", "job_title": "Interaction Designer"}, "346": {"website": "http://rabolton.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "boltonra", "time": "14:00:00", "period": "", "entry_id": "346", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["Sculpture is often concerned with mapping the human body and locating it in relation to the world. Sculptors create objects that are meant to be seen, felt, walked around and directly experienced. Interaction designers, too, are concerned with creating and defining experiences for their audience to directly engage in. Why not see what the one can contribute to the other? Are there things to be learned from sculpture that can be applied to interaction design?", "Through ethnographic observations, conversations with sculptors and sculpture aficionados, and an extensive literature review on art history, theory and criticism I have endeavored to answer those questions. Over time, I have identified six aspects of sculpture that are applicable to interaction design: context, multiple viewpoints, bodily empathy, physical parts, multi-sensory engagement and form. During the talk, I will introduce these aspects and use them to critically examine existing interactive artifacts and suggest ways to use them as design lenses."], "last": "Bolton-Nasir", "name": "", "room": "Liffey B", "gender": "F", "length": "10", "theme": "Theory", "country": "us", "organization": "Electronic Ink", "session_title": "Sculpted! Using Sculpture as a Design Lens ", "first": "Rachel", "add_class": "", "job_title": "Design Researcher"}, "402": {"website": "http://www.rachelhinman.com", "status": "sold-out", "suffix": "", "session_type": "workshop", "twitter": "hinman", "time": "9:30:00", "period": "Morning", "entry_id": "402", "sponsor": "", "another": "No", "date": "2012-02-01", "description": ["We&rsquo;ve heard it all before&hellip; prototype, prototype, prototype! It&rsquo;s a standard step in almost any design process &#8212; but often the first step skipped in time and budget constrained projects. Although prototyping is considered a luxury for many PC-based experiences, it is an absolutely essential part of creating compelling tablet and mobile experiences.", "This workshop will outline why prototyping is an essential part of the emerging world of tablet and mobile experience design. You&rsquo;ll learn the underlying design principles and design conventions of Natural User Interfaces (NUIs), animated transitions and the interaction design language that is emerging as touchscreen devices become commonplace. You&rsquo;ll also learn how and why to cultivate the two most important skills necessary for creating compelling tablet and mobile experiences: a curiosity for context and ruthless editing.", "Finally, you&rsquo;ll learn a wide variety of hands-on prototyping methods that can be applied to your design process. You&rsquo;ll receive tactical, hands-on instruction for how to storyboard concepts and screens, sketch transitions, and turn your ideas into high-fidelity on-device prototypes with speed and confidence.", "The workshop will cover:", "", " &bull; Natural user interfaces (Activity: Translating GUI to a NUI)", " &bull; Fostering new skills such as ruthless editing, a curiosity for context, learning the language of transition (Activity: identifying and sketching transitions)", " &bull; Tablet/mobile prototyping methods including storyboarding, low-fidelity prototyping and high-fidelity prototyping (Activity: identifying and sketching transitions)", "Participants will:", " &bull; Understand the design principles and conventions for Natural User Interfaces.", " &bull; Understand why a curiosity for context and ruthless editing are important to tablet and mobile UX design", " &bull; Learn how to cultivate these skills", " &bull; Be exposed to the language of interface transitions: what they are, when to use them and how to sketch them", " &bull; Experience three prototyping methods: when they should be used and the questions they should help answer", "This is a workshop aimed at designers, developers, and UX professionals keen to transition from desktop to mobile and tablet experiences."], "last": "Hinman", "name": "", "room": "C034", "gender": "F", "length": "180", "theme": "Process", "country": "us", "organization": "Nokia", "session_title": "Mobile Prototyping Essentials", "first": "Rachel", "add_class": "", "job_title": "Senior Research Scientist"}, "401": {"website": "http://odannyboy.com", "status": "sold-out", "suffix": "", "session_type": "workshop", "twitter": "odannyboy", "time": "13:30:00", "period": "Afternoon", "entry_id": "401", "sponsor": "", "another": "No", "date": "2012-02-01", "description": ["Hundreds of millions of touchscreen devices will be on the market in the next three years. Are you ready to design for them? What do you need to know? What are the best practices gleaned from the last five years of wide-spread touchscreen use?", "At the end of the workshop, you should have an understanding of the issues surrounding designing for touchscreen devices, know where the best places on a device are for positioning actions, be able to work around fingers not cursors, &ldquo;translate&rdquo; an application from a web/desktop based one to touch, and paper prototype an app for mobile touch.", "What will be covered?", " &bull; Exploring designing for fingers instead of a cursor or 5-way", " &bull; Learning how to design touch targets", " &bull; Discussing activity zones and positioning of menus and controls", " &bull; Paper prototyping an app for a small touchscreen", " &bull; How to communicate the presence and instructions for gestures", " &bull; Exercises in the design language of mobile touch", " &bull; Paper prototyping an app for a tablet", "This workshop is designed for those learning how to design for touchscreens or who want to improve their touchscreen expertise with some technical knowledge and thoughtful, hands-on practice."], "last": "Saffer", "name": "Mr.", "room": "C036", "gender": "M", "length": "180", "theme": "Dialogue", "country": "us", "organization": "Syntactic Devices", "session_title": "Tap is the New Click: A hands-on (fingers-on?) workshop for designing for touchscreens and tablets", "first": "Dan", "add_class": "", "job_title": "Founder"}, "280": {"full_name_two": "", "name_two": "Ms.", "suffix": "", "twitter": "christina_xd", "period": "", "entry_id": "280", "sponsor": "", "another": "Yes", "job_title_two": "Experience Design Consultant", "first_two": "Joan", "last_two": "Vermette", "country_two": "us", "email_two": "jvermette@madpow.net", "theme": "Process", "session_title": "I Hate Process. I Love Process: Why designers are divided about process and what to do about it", "add_class": "", "job_title": "Experience Design Director", "website": "http://www.madpow.net", "description": ["As a designer, have you ever felt frustrated by having to break the creative process up into tiny task boxes that block the way to good design?", "Have you ever felt frustrated by a lack of structure, leading to endless rework, crossed communication lines, and plain old wasted time?", "There&apos;s too much process in some cultures, and not enough in others. And we declare that we hate process or we love process, as though that were an immutable quality of our souls.", "But what do designers need?", "We believe in a core, necessary way of sequencing design work to get the best results. Borrowing from Design Sojourn&rsquo;s Brian Ling, we express this core as &ldquo;Think &#8211; Draw &#8211; Make.&rdquo; When process chafes us as designers, it&rsquo;s a sign that an organization is unbalanced in one of these three key activities. If they frontload a project with tons of research and still can&rsquo;t make a decision, they&rsquo;re caught in &ldquo;think.&rdquo; If they ask us to come to the kickoff with wireframes, they&rsquo;re caught in &ldquo;draw.&rdquo; If they&rsquo;re hell-bent on getting to build immediately, they&rsquo;re caught in &ldquo;make.&rdquo;Similarly, we&rsquo;re not blank slates, either &#8211; each of us brings our particular skills to a project, and we have our own attachments, as well.", "Our presentation will discuss how to know which culture you&rsquo;re dealing with, where you sit with regard to that culture, and provide some skills for how to bring yourself and the culture together back into balance."], "session_type": "presentation", "time": "11:30:00", "twitter_two": "jayeffvee", "date": "2012-02-02", "suffix_two": "", "room": "Liffey 1", "last": "Persson", "name": "Ms. ", "gender": "F", "website_two": "http://madpow.net", "length": "45", "status": "accepted", "gender_two": "F", "biography_two": "Joan Vermette has 14 years as a UX designer/manager, nearly all of it as a charter member of the design group at Fidelity Investments for which she created and promoted design process, standards, and their component library. For nearly two years, Joan has been a user experience design consultant at Mad*Pow. She’s interested in design process and how to sustain organizational learning about design over time. She doesn't think documentation necessarily has to die on the shelf.\\nJoan has a BA in Cultural Theory from Brandeis University.", "organization": "Mad*Pow", "country": "us", "organization_two": "Mad*Pow", "first": "Christina"}, "282": {"website": "http://www.normalmodes.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "normalmodes", "time": "11:05:00", "period": "", "entry_id": "282", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["While many professionals have years of experience in interaction design, it&rsquo;s often limited to just one platform: the Web. In this presentation, Normal Modes will discuss creating great experiences on a variety of platforms.", "After all, designing a customer experience is about more than web, mobile and social media. The problem is that other platforms — like kiosks, in-store displays, and IVR systems — are widely ignored. While designing the end-to-end customer experience includes popular experiences like mobile and social, there&rsquo;s a world of other customer experience platforms that are currently left out of the conversation. Text messaging and voice messaging, in particular, are underutilized as communications platforms, and voice automation systems are routinely BAD (OK, really bad) experiences that few are addressing.", "We&rsquo;ll discuss how experience maps help identify all touch points in the experience lifecycle. With this information, we can monitor each touch point and identify points of failure, ambiguity, and opportunities for improvement. We&rsquo;ll talk about how choosing the right tool at the right time to communicate with customers is an important aspect of creating the overall experience, but is currently limited by the inexperience of many interaction designer with non-standard platforms. We&rsquo;ll also talk about some examples from each platform by companies who are doing it right."], "last": "Schmeidel Randall", "name": "", "room": "Liffey 2", "gender": "F", "length": "45", "theme": "Strategy", "country": "us", "organization": "Normal Modes", "session_title": "Touchy! Identifying Every Touch Point in the Experience Life Cycle", "first": "Angela", "add_class": "", "job_title": "Chief eXperience Officer"}, "349": {"full_name_two": "", "name_two": "Mr.", "suffix": "", "twitter": "fred_beecher", "period": "Morning", "entry_id": "349", "sponsor": "", "another": "Yes", "job_title_two": "Senior User Experience Consultant", "first_two": "Jeff", "last_two": "Harrison", "country_two": "us", "email_two": " jharrison@evantageconsulting.com", "theme": "Process", "session_title": "Prototyping Native Mobile Applications in Axure", "add_class": "", "job_title": "Lead User Experience Consultant", "website": "http://userexperience.evantageconsulting.com", "description": ["While prototyping has become a common component of interaction design processes for building Web and desktop applications, it hasn&rsquo;t yet caught on in the mobile realm. First, mobile apps are often regarded as bite-sized software, something that&rsquo;s more important to launch than to get right the first time. Any major problems can just be fixed later, or so the theory goes. Second, there simply aren&rsquo;t the tools out there to make it easy for designers to prototype the rich interactions characteristic of native mobile applications. Axure isn&rsquo;t perfect for this either, but with the release of Version 6 it has become feasible to prototype these types of apps. Participants will be expected to have a working knowledge of how to prototype rich interactions in Axure. They will also be required to bring a laptop with Axure 6 and a mobile device that can access an external website (an iOS or Android device would be best).", "This workshop will focus specifically on prototyping native mobile applications because there is very little you need to alter about how you use Axure to prototype for the mobile Web (which we will touch on). Also, it&rsquo;s the gestures and animations characteristic of native mobile applications that are the most difficult things to prototype, the most useful things to test, and the functionality that&rsquo;s most commonly left out of other mobile prototyping tools.", "We will begin by demonstrating to participants how to run an Axure prototype on a mobile device, giving them the opportunity to try it out for themselves. We will also provide them with and introduce them to our lightweight mobile prototyping Axure framework, which will be used to complete the remaining exercises.", "The main course content begins with a discussion of how to prototype typical native mobile animations, such as tap feedback, slides &amp; fades, and animated widgets such as modal views and toggles. We will encourage participants to follow along with us as we demonstrate these techniques, but we will also give them the opportunity to complete an exercise in which they have to prototype mobile native animated interactions.", "We will then discuss the many options for allowing users to trigger gestures on their prototypes. Because Axure outputs HTML, CSS and JavaScript, users will not be able to simply swipe or three-finger-drag an object. We will offer up three different strategies for triggering gestures and provide participants with the opportunity to build a gesture-triggering prototype themselves. Additionally, the mobile prototyping framework we will present them with will include the fully articulated version of one of these strategies.", "Finally, we will walk through a series of common native mobile interactions, teaching participants how to prototype each one using Axure. One facilitator will demonstrate, while the other will answer questions and provide feedback to workshop participants. The session will end with a Q&amp;A session where participants can ask to learn how to prototype other specific interactions."], "session_type": "workshop", "time": "9:30:00", "twitter_two": "mrjeffharrison", "date": "2012-02-01", "suffix_two": "", "room": "Mac Lab", "last": "Beecher", "name": "Mr.", "gender": "M", "website_two": "http://userexperience.evantageconsulting.com", "length": "180", "status": "accepted", "gender_two": "M", "biography_two": "Jeff Harrison is a senior user experience consultant with Evantage Consulting. He blends superb analytical ability, creative thinking, and experience solving real-world business problems to translate business requirements and user research into simple, efficient interactions. Most design problems don’t have a perfect solution, but Jeff can usually come up with a number of good options, explain the pros and cons of each, and suggest a way of testing them to arrive at the best. Jeff has become recognized within the user experience community for his expertise with the Axure RP Pro prototyping tool, and his willingness to solve thorny problems.", "organization": "Evantage Consulting", "country": "us", "organization_two": "Evantage Consulting", "first": "Fred"}, "R1": {"status": "approved", "room": "Liffey 1", "session_type": "sponsored-activity", "theme": "Special Event", "length": "120", "entry_id": "R1", "sponsor": "Coroflot", "time": "17:30:00", "date": "2012-02-02", "session_title": "Coroflot Networking Reception", "description": ["IxDA and creative industry giant Coroflot invite you to a cocktail reception dedicated to in-person networking. The Coroflot Networking Reception is designed to connect you with firms who want to meet you &#8211; the world&apos;s top talent. Come and enjoy drinks and hors d'oeuvres. See who&apos;s there, introduce yourself, talk about why you love interaction design, what you aspire to, and you may just find opportunities that surprise you.", "This event is limited to 200 people. Please sign up here: <a href=\"http://www.coroflot.com/connects/\" target=\"_blank\">http://www.coroflot.com/connects/</a>.", "If you are interested in having a recruiter station at this event, please contact Coroflot: <a href=\"mailto:sales@coroflot.com\">sales@coroflot.com</a>.", "This event will take place at the Banking Hall of the <a href=\"http://www.thewestindublin.com/\" title=\"Westin Dublin\" target=\"_blank\">Westin Dublin</a>."]}, "R2": {"status": "approved", "room": "Liffey B", "session_type": "sponsored-activity", "theme": "Special Event", "length": "210", "entry_id": "R2", "sponsor": "Sapient Nitro", "time": "17:30:00", "date": "2012-02-02", "session_title": "The Great IxDA Debate", "description": ["UX heavyweights go head-to-head to tackle some of the biggest interaction design questions of our time.", "Setting the stage on fire we have: [Andrea Resmini], [Dave Malouf], [Giles Colborne], [Jason Mesut], [Jeff Gothelf], Kieron Leppard, Pete Trainor, and Dan Willis.", "Join the debate to have your opinions heard or just grab a bite and a drink to enjoy live action from these great thought leaders.", "For more details, and info on how to attend, follow us on Twitter &#8211; <a href=\"http://twitter.com/IxDAdebate/\" target=\"_blank\">IxDAdebate</a>."]}, "260": {"website": "http://www.andrewhinton.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "inkblurt", "time": "14:30:00", "period": "", "entry_id": "260", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["Much of user-experience design borrows from methods that assume users have discrete &amp; identifiable goals. However, this assumption can seriously inhibit designing for real human behavior, which (as we will see) often has less to do with rationality than we tend to think. We&apos;ll examine how framing users in terms of predetermined goals can trip us up, and look at improved models that better connect behavior with context, to ultimately accommodate people&apos;s natural actions rather than attempt to over-engineer and prescribe their experience."], "last": "Hinton", "name": "Mr.", "room": "Liffey B", "gender": "M", "length": "10", "theme": "Behaviour", "country": "us", "organization": "Macquarium", "session_title": "Users Don't Have Goals ", "first": "Andrew", "add_class": "", "job_title": "Principal UX Architect"}, "124": {"website": "http://www.usabilityfail.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "leegoesplaces", "time": "14:10:00", "period": "", "entry_id": "124", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["What do bakers, metalsmiths and user experience professionals have in common? They're all crafts, but unlike other crafts, UX doesn&apos;t have a mentality of apprenticeship and practice. I argue that because UX requires broad knowledge across a number of disciplines, practical experience, and people skills, simply getting a degree and attending conferences isn&apos;t enough. If we want the UX field to grow and mature, we should re-think how we grow and mature incoming UX professionals."], "last": "Gingras", "name": "", "room": "Liffey 2", "gender": "F", "length": "10", "theme": "Process", "country": "us", "organization": "ITHAKA", "session_title": "The craft of UX: The need for apprenticeships and practice", "first": "Leanna", "add_class": "", "job_title": "User Research Coordinator"}, "333": {"website": "http://www.caemmerer.net", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "billbc", "time": "14:25:00", "period": "", "entry_id": "333", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["Just like every picture, every graph tells a story, or it should. Frequently the story we want to tell is a comparison to the past or to our plans, a \"what happened\" story. Do we have the best tools to tell this story visually, in graphs? In this presentation, we&apos;ll look at the common strategies like pies, bars, thermometers and heat maps, and how well they tell us \"what happened.\" Next we&apos;ll look at a new approach, the &ldquo;skyline&rdquo; graph, which combines elements of the others to tell the visual story of \"what happened\" in a way that should be illuminating and useful."], "last": "Caemmerer", "name": "Mr.", "room": "Liffey 1", "gender": "M", "length": "10", "theme": "Context", "country": "us", "organization": "Independent", "session_title": "Telling the Data Comparison Story Using A Skyline Graph (Instead of Two Pies)", "first": "Bill", "add_class": "", "job_title": "Interaction Designer"}, "265": {"website": "http://nordkapp.fi", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "samin", "time": "14:30:00", "period": "", "entry_id": "265", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["I this short talk, I will present 10 key findings from our work on designing services for the city of Helsinki"], "last": "Niemelä", "name": "Mr.", "room": "Liffey 1", "gender": "M", "length": "10", "theme": "Context", "country": "fi", "organization": "Nordkapp", "session_title": "Input/Output: Interaction design at the intersection of city and its interfaces", "first": "Sami", "add_class": "", "job_title": "Creative Director"}, "51": {"website": "http://www.citrix.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "", "time": "14:00:00", "period": "", "entry_id": "51", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["It&rsquo;s easy to get caught up in the detailed design of a product, but sometimes you need to step back and look at whether people are really adopting your product. This talk will describe how we&rsquo;ve leveraged Roger&rsquo;s Diffusion of Innovation model and concepts from Geoffrey Moore&rsquo;s Crossing the Chasm to craft a research plan that examines the &ldquo;adaptability&rdquo; of products. By understanding how customers use your product and the barriers to adoption, you can be more strategic about the design issues that you address and get across the &ldquo;chasm&rdquo; of product adoption. We&rsquo;ll describe a program in which we gave our product to customers to evaluate and how we took that feedback to inform the product design."], "last": "Baher", "name": "", "room": "Liffey 1", "gender": "F", "length": "10", "theme": "Process", "country": "us", "organization": "Citrix", "session_title": "Why is no one using your product?", "first": "Julie", "add_class": "", "job_title": "Director of Product Design"}, "50": {"website": "http://odannyboy.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "odannyboy", "time": "13:55:00", "period": "", "entry_id": "50", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["Continuing his award-winning and highly-acclaimed \"How to Lie With&hellip;\" series, Dr. Saffer** will illuminate the world of Design Thinking: namely what you need to know to fake your way through conversations about design thinking. Topics to be covered include: IDEO, Bruce Nussbaum, Fast Company, service design, post-it notes, &ldquo;proof-of-concept&rdquo; videos, 37signals, James Joyce, and whatever happens to be in the news that week. Each and every audience member will be certified as a Design Thinker by Dr. Saffer** (diploma not included).", "** Saffer is not a real doctor. If you're experiencing burning or itching, please see a physician."], "last": "Saffer", "name": "Mr.", "room": "Liffey B", "gender": "M", "length": "10", "theme": "Theory", "country": "us", "organization": "Syntactic Devices", "session_title": "How to Lie with Design Thinking", "first": "Dan", "add_class": "", "job_title": "Founder"}, "379": {"website": "http://www.joshsin.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "joshuasin", "time": "14:10:00", "period": "", "entry_id": "379", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["Nature has survived the past 3.5 billion years on Earth. It&rsquo;s been mastering and fine-tuning itself to create conditions conducive to life. It has a strategy and a system that constantly adapts and evolves. It&rsquo;s obviously doing something right.", "What if we can solve problems like nature? Our processes and systems could self-organize, optimize rather than maximize, and be locally attuned and responsive.", "Natural ecosystems are self-sustainable, highly attuned and responsive, and work in a cyclic process. It has a constant cyclic process that learns and imitates while being able to self-organize.", "Natural ecosystems interact with other systems surrounding it.", "Can our systems in our design and business process be as dynamic and smart as nature?"], "last": "Sin", "name": "Mr.", "room": "Liffey 1", "gender": "M", "length": "10", "theme": "Ecosystems", "country": "us", "organization": "Crispin Porter + Bogusky", "session_title": "What would nature do? Natural ecosystems vs. design/business ecosystems", "first": "Joshua", "add_class": "", "job_title": "Experience Design"}, "295": {"website": "http://andrearesmini.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "resmini", "time": "11:55:00", "period": "", "entry_id": "295", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["In our role as consumers of services, as information bleeds into the physical world we face an increasing multitude of different environments, interfaces, and procedures which, from our perspective, all participate in one single activity: completing the goal at hand.", "This is nowhere more visible than in complex activities requiring multiple, consecutive, or prolonged interactions: for example in dealing with the healthcare system, or when using any combination of public and private means of transport. These complex tasks have a potential to confuse, frustrate, and provide inconsistent user experiences as we try to make sense of things while using different combinations of websites, smartphones, real-time displays, street or shop signage, and traditional paper-based materials such as maps and timetables. This talk details the early stages in the design of a systemic, cross-channel approach to public transportation for the city of Gothenburg, Sweden, how gamification has been applied to the process to make co-modal travel strategies an enticing prospect for passengers and a key element in the city&apos;s vision for a sustainable future, and how bus stops have been refitted as active touchpoints in a larger, seamless cross-channel customer journey.", "Questions the talk will try to answer are: What pieces of information are needed? What artifacts are necessary for a base system to work? How do cross-channel guidelines become effective (by providing third-parties with a competitive edge, a business advantage, a reduced time-to market)? What deliverables for cross-channel experiences? What benefits from gamification?"], "last": "Resmini", "name": "Dr.", "room": "Liffey 2", "gender": "M", "length": "45", "theme": "Ecosystems", "country": "se", "organization": "University of Borås", "session_title": "All Aboard: A Cross-channel Approach to the Gamification of Public Transport", "first": "Andrea", "add_class": "", "job_title": "Information Architect"}, "376": {"website": "http://www.jonesabi.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "jonesabi", "time": "14:15:00", "period": "", "entry_id": "376", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["In your head you&apos;ve probably called your users a lot of names, but is 'Hobbits' one of them?", "Thinking about your users as Hobbits can help you frame the use of your website or application and help you put yourself in the user&apos;s shoes. Uh, except they're hobbits, so they're not wearing shoes.", "Thinking about your users Hobbits will help you by:", " &bull; Establishing a path through the application", " &bull; Creating a call to adventure (even if you work in online banking)", " &bull; Showing how to overcome Frodo&apos;s (ahem, a user&apos;s) refusal of the call", " &bull; Introducing a mentor (like Gandalf or Yoda)", " &bull; Helping users overcome an ordeal (ordering pizza online counts), and", " &bull; Returning as a changed person (ideally changed for the better)."], "last": "Jones", "name": "", "room": "Liffey B", "gender": "F", "length": "10", "theme": "Process", "country": "us", "organization": "Google", "session_title": "Your Users are Hobbits: How classic quests can inform your next design", "first": "Abi", "add_class": "", "job_title": "Interaction Designer"}, "319": {"website": "http://michaellemmon.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "mikelemmon", "time": "10:20:00", "period": "", "entry_id": "319", "sponsor": "", "another": "No", "date": "2012-02-02", "description": ["You know how you can recognize a Porsche sports car regardless of the model or year? This is effective design language at work. A design language establishes the visual vocabulary, relationships and hierarchies that allow diverse products to become recognizable and unified. This tool has long been used in industrial design to create coherent families of products. But as products become digital and shift to multi-platform app-driven ecosystems, what constitutes an effective design language for interaction that can drive consistency across these varied experiences?", "This presentation provides a framework for how to establish an interaction design language by sharing professional project experiences and examples."], "last": "Lemmon", "name": "Mr.", "room": "Liffey 2", "gender": "M", "length": "45", "theme": "Ecosystems", "country": "us", "organization": "Ziba Design", "session_title": "Design Language for Interactions", "first": "Michael", "add_class": "", "job_title": "Creative Director"}, "196": {"website": "", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "", "time": "11:30:00", "period": "", "entry_id": "196", "sponsor": "", "another": "No", "date": "2012-02-02", "description": ["Remember the days when there was just a PC? &#8211; A single form factor to consider when designing an application or web site. It was landscape format, mouse-interaction based, and with relatively high resolution.", "Well, times have dramatically changed since then&hellip; Today, there are numerous desktop and mobile devices out there &#8211; in different shapes, sizes, technologies, resolutions, input methods, features, and more.", "These also represent a variety of users, interaction models, behaviors, use cases, contexts, needs, goals, environments, etc.", "So how do you design for all of these different devices? And even more interestingly &#8211; How do you design for multiple devices which are all part of a product ecosystem?", "This presentation (with the help of Seinfeld and some Friends), will discuss the unique challenges interaction designers face when designing for an ecosystem of devices. It will present the unique considerations and complexities to take into account, and try to pave the way towards finding the right, delicate balance between consistency across the ecosystem and optimized UX per device."], "last": "Levin", "name": "Miss", "room": "Liffey 2", "gender": "F", "length": "45", "theme": "Ecosystems", "country": "is", "organization": "Google (Israel)", "session_title": "Does size matter? ", "first": "Michal", "add_class": "", "job_title": "User Experience Designer"}, "314": {"website": "http://www.seren.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "jrez", "time": "14:15:00", "period": "", "entry_id": "314", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["By the end of 2011 more than 50M NFC enabled mobile devices are expected to be sold world-wide. Initially these will be used for contactless payments, transport ticketing and retail loyalty programs and vouchers, replacing physical plastic cards and paper coupons. Long term, mobile wallets will potentially store identity information. Seren is currently in the process of designing the mobile wallet experience for one of the world&apos;s leading global mobile network operator. Some of the interesting questions we are currently facing are based around users' mental models, perceptions and expectation and the collision between real-world and virtual wallets.", "During this session I intend to share some of the unique challenges we have had to tackle along the way. I plan to look at high level user-experience paradigms as well as specific interactions patterns and how they support relevant use-cases and the complex technological challenges."], "last": "Rez", "name": "Mr.", "room": "Liffey 1", "gender": "M", "length": "10", "theme": "Context", "country": "uk", "organization": "Seren Partners", "session_title": "Designing the mobile wallet experience", "first": "Jonathan", "add_class": "", "job_title": "Senior User Experience Consultant"}, "M5": {"status": "approved", "theme": "Announcements", "room": "Liffey B", "session_type": "activity", "period": "", "name": "Group", "length": "30", "entry_id": "M5", "sponsor": "", "time": "9:00:00", "date": "2012-02-02", "session_title": "Welcome", "first": "Conference Chair & IxDA President", "add_class": "", "description": [""]}, "271": {"website": "http://cxpartners.co.uk", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "gilescolborne", "time": "13:45:00", "period": "", "entry_id": "271", "sponsor": "", "another": "No", "date": "2012-02-02", "description": ["If you&apos;ve ever shouted at a computer, you&apos;ll know that they can be infuriating colleagues. Since Asimov&apos;s iRobot we&apos;ve recognised that human-computer relationships are beset by disfunction. Inconsistency and lack of 'emotional intelligence' are computers' personality disorders. We have an opportunity to create context-aware interfaces with emotional intelligence. How can we do this and apply it today in defining and designing interactions?", "Team players", "How can computers work with teams of people? For instance, Belbin Team Roles tell us about how different personality types play specific roles on teams. What roles are suited to computers' strengths? What feature sets and behaviours will make them coherent, consistent team players that human members can relate to? I&apos;ll show this is a tool that attendees can apply immediately.", "Emotionally smarter", "I&apos;ve interviewed professionals such as psychiatrists and negotiators to see how they apply emotional intelligence. For instance, negotiators adapt their behaviour to others' stress levels. They don&apos;t tell an angry person to 'calm down' &#8211; they mirror their emotional level and 'bring them down'. I&apos;ll show how we can already detect users' emotional states and how to apply this knowledge. I&apos;ll propose techniques for attendees to discuss and apply.", "The presentation will focus on stories, tips and discussion. But I&apos;ll provide plenty of references and reading recommendations for the audience to explore afterwards.", "We often talk about emotion in terms of the user&apos;s experience. It&apos;s time computers got emotionally smarter. This presentation will give attendees tools to design interfaces that do that."], "last": "Colborne", "name": "Mr.", "room": "Liffey B", "gender": "M", "length": "45", "theme": "Behaviour", "country": "uk", "organization": "cxpartners", "session_title": "Artificial emotional intelligence: Designing interactions for emotional awareness", "first": "Giles", "add_class": "", "job_title": "Managing Director"}, "M7": {"status": "approved", "theme": "Special Event", "room": "City Centre", "session_type": "sponsored-activity", "period": "Evening", "length": "180", "entry_id": "M7", "sponsor": "Moment", "time": "19:30:00", "date": "2012-02-02", "session_title": "Dublin Journeys", "description": ["You're not leaving Dublin without a decent pub crawl, are you? IxDA and Moment offer you a toolkit to get the best of Dublin&apos;s nightlife, culture and art. Several tracks will guide you and your friends to pubs and places related to a cultural theme like music, literature or art. The epicenter of the Dublin Journeys is located in Temple Bar, Dublin&apos;s most vibrant area. Each track includes restaurants to start the evening with a dinner."]}, "M6": {"status": "approved", "theme": "Special Event", "room": "Trinity", "session_type": "sponsored-activity", "period": "Evening", "length": "180", "entry_id": "M6", "sponsor": "GE", "time": "19:30:00", "date": "2012-02-01", "session_title": "Opening Party", "description": ["On Wednesday night IxDA and GE will kick off the conference with a party to welcome you to Dublin. The Trinity College, Ireland&apos;s oldest university, will be the décor for a night filled with showcases of the best interaction design Dublin has to offer, with live Irish music and Irish tapas. Welcome to Dublin!"]}, "M1": {"status": "approved", "room": "The Canteen", "session_type": "break", "theme": "Meal", "length": "90", "entry_id": "M1", "sponsor": "", "time": "12:00:00", "date": "2012-02-01", "session_title": "Lunch", "description": [""]}, "M3": {"status": "approved", "room": "Liffey A", "session_type": "break", "theme": "Meal", "length": "30", "entry_id": "M3", "sponsor": "", "time": "9:00:00", "date": "2012-02-03", "session_title": "Breakfast & Coffee", "description": [""]}, "M2": {"status": "approved", "room": "Liffey A/B", "session_type": "break", "theme": "Meal", "length": "30", "entry_id": "M2", "sponsor": "", "time": "8:30:00", "date": "2012-02-02", "session_title": "Registration / Breakfast & Coffee", "description": [""]}, "279": {"full_name_two": "", "name_two": "Mr.", "suffix": "", "twitter": "jasonmesut", "period": "Afternoon", "entry_id": "279", "sponsor": "", "another": "Yes", "job_title_two": "User Experience Consultant", "first_two": "Sam", "last_two": "Smith", "country_two": "uk", "email_two": "sam.smith@rma-consulting.com", "theme": "Process", "session_title": "Sketching Interfaces", "add_class": "", "job_title": "Head of User Experience", "website": "http://www.rma-consulting.com", "description": ["Sketching is a core skill of any designer, but everyone can always learn to sketch quicker, clearer and more impressively in front of their peers, colleagues and clients.", "This sketching workshop will be heavily focused on fast-paced and fun practical activities with a smattering of theory. Key activities will likely include:", " &bull; Knowing your materials and your tools &#8211; from pens and pencils through to different paper and sketchbooks, we will share our experience of what you should bear in mind before you get down to the doodling", " &bull; Warming up &#8211; getting comfortable with your tools and getting into the headspace for better sketching", " &bull; Sketching concepts &#8211; communicating abstract concepts to others", " &bull; Sketching quickly &#8211; tips and activities for sketching quicker but still getting across your ideas", " &bull; Sketching choreography &#8211; how to communicate the dance of the user interface you are designing (e.g states and transitions)", " &bull; Sketching 3D products &#8211; how to sketch basic 3D shapes", " &bull; Annotating sketches for others &#8211; helping them to understand your scribbles", " &bull; Collaborative sketching &#8211; how to sketch effectively with others", " &bull; Different sketch styles &#8211; learning from others&rsquo; different styles of sketching", " &bull; Packaging up sketches for presentations and deliverables &#8211; how to package up your sketch work for others to review", " &bull; Running a sketchbook &#8211; tips for running your own sketchbook and improving your practice every day", "By the end of the workshop, people will have learned some different techniques for sketching, seen a range of different sketching styles and be equipped with greater confidence to sketch in front of others."], "session_type": "workshop", "time": "13:30:00", "twitter_two": "pub", "date": "2012-02-01", "suffix_two": "", "room": "C034", "last": "Mesut", "name": "Mr.", "gender": "M", "website_two": "http://www.rma-consulting.com", "length": "180", "status": "accepted", "gender_two": "M", "biography_two": "I work for RMA Consulting as a UX Consultant. We build \"day in, day out\" (DIDO) applications - apps that allow users to master complex data and harness it for action as part of their daily working lives. Prior to RMA I spent 10 years working in design/UX roles, at agencies (including the Team, Freestyle Interactive and Digitas) and client-side (Rightmove.co.uk and The University of Birmingham). When I'm not filling sketchbooks with ideas, I'm up to my elbows in clay (sculpting) or reflecting on how lucky I am that I get to do a job that I love.", "organization": "RMA Consulting", "country": "uk", "organization_two": "RMA Consulting", "first": "Jason"}, "80": {"website": "http://www.fabrique.nl", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "jeroenvangeel", "time": "11:50:00", "period": "", "entry_id": "80", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["Storytelling is a very powerful way of bringing a message across. When done right it&rsquo;s a way of engaging the audience and guiding them into the world you create. And it&rsquo;s this powerful thing that&rsquo;s been used in the creation of books, movies, music and theatre. But now it&rsquo;s time to turn this knowledge into something we as designers can use to create engaging websites.", "In this talk I want to step-by-step take people through a framework I created (http://johnnyholland.org/2011/01/20/aristotle%E2%80%99s-storytelling-framework-for-interactive-products/) that will help designers to create a website that tells the best story and engages in the correct way with it&rsquo;s users. The core message is that you need to build up a story in the right way in order to create more solid websites and to enable a real understanding of what&rsquo;s the core of the product your design. (e.g. when you have a good understanding of the plot &amp; character you are able to apply many different themes)Going through each step of the framework I will relate this to a movie and bring in examples from the web. When giving examples I will emphasize the importance of building up by showing the dangers of doing it the other way around (a lot of designers like starting with cool features or the graphic design, but the danger is that there is a big disconnect with the core message of the product and/or the audience). I will conclude by showing the entire framework."], "last": "van Geel", "name": "Mr.", "room": "Liffey 1", "gender": "M", "length": "45", "theme": "Process", "country": "nl", "organization": "Fabrique [brands, design & interaction]", "session_title": "Aristotle’s Storytelling Framework for the web", "first": "Jeroen", "add_class": "", "job_title": "Interaction Director"}, "M9": {"status": "approved", "theme": "Special Event", "room": "Guinness Storehouse", "session_type": "sponsored-activity", "period": "Evening", "length": "270", "entry_id": "M9", "sponsor": "Microsoft", "time": "18:00:00", "date": "2012-02-04", "session_title": "Closing Party", "description": ["IxDA and Microsoft invite you to celebrate the last night of Interaction12 with a closing party at Ireland&apos;s #1 visitor attraction. After four days of immersing in interaction design, the Closing Party will prepare you to leave Dublin and connect to the world again. The Gravity Bar at on the 7th floor with its unique 360° view of Dublin City will offer you a lasting memory: you&apos;ve been at Interaction12 | Dublin. Enjoy a night of music, dancing, playing, a delicious dinner buffet and &#8211; hey, no one is fooling you &#8211; a pint of Guinness."]}, "118": {"website": "http://www.frogdesign.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "dsnazarian", "time": "11:05:00", "period": "", "entry_id": "118", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["If you subscribe to the notion that interaction design makes an important contribution to the somewhat broader endeavor of systems design, then you will no doubt appreciate that many of the most challenging problems and perhaps rewarding insights may arise from considering systems &#8211; and their attendant interactions &#8211; at scale.", "This presentation embarks upon a poetic thought experiment (suspending for a moment the more intractable human issues within our immediate sphere) in which we explore the essential tenets of a design challenge the scale and complexity of which the world has not yet seen: the design of a starship capable of interstellar travel. With very little meditation on the technical challenges this may pose, the presentation narrative focuses on the necessary evolution of human enterprise, including economy, governance and infrastructure that might be necessary for the actualization of such a proposal.", "How do designers engage in the design of ever more complicated systems? By considering the starship and the extreme complexity it represents, this presentation hopes to stir debate around design priorities at the &ldquo;policy&rdquo; level and what strategies might exist for addressing the many extreme design challenges facing humanity, currently. Overall, this presentation is aimed at raising the interaction design community&apos;s awareness of the interconnected systems that may impact their day-to-day in a sincere, if somewhat whimsical, format."], "last": "Nazarian", "name": "Mr.", "room": "Liffey 1", "gender": "M", "length": "45", "theme": "Ecosystems", "country": "us", "organization": "frog", "session_title": "Building a Better Starship: Scaling Design Systems into Humanity's Future ", "first": "Scott", "add_class": "", "job_title": "Creative Director"}, "84": {"website": "http://digital-outcasts.com/", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "kelsmith", "time": "11:30:00", "period": "", "entry_id": "84", "sponsor": "", "another": "No", "date": "2012-02-02", "description": ["Despite our growing potential to augment human capability through technology, the innovation curve sometimes leaves behind people who could most benefit. We&rsquo;ll call this group the &ldquo;digital outcasts&rdquo; (a term introduced by researchers from the University of Sussex), and they ironically reside at the epicenter of today&rsquo;s most exciting developments.", "On a purely grass-roots level, digital outcasts are taking it upon themselves to improve and sustain their success in life. They are doing this through personally customized solutions that otherwise wouldn&rsquo;t exist. Interestingly, their efforts then contribute mightily to the same technological landscape that originally neglected them. For such an important (and growing) demographic, this represents a cultural sea change of increasing significance.", "Participants of this session will explore the significance of digital outcasts in the creation of such emerging technologies as mobile apps, video games, personalized robotics and virtual worlds. Emphasis will be placed on products and services in the health sector, with recent case studies spanning multiple therapeutic contexts: blindness/low vision, long-term rehabilitation, oncology, physical therapy, degenerative disease, cognitive disorders and opioid-free pain management. Practical examples will include such platforms as the iPad, Nintendo Wii, haptic interfaces, virtual prosthetics, text-to-speech functionality, eye-tracking, adaptive mobile devices and Second Life.", "Regardless of channel &#8211; at some point in their lives, everyone gets older and must enter the digital looking glass. This presentation will emphasize the importance of embracing universal design principles throughout development cycles, thus creating ambient, barrier-free benefit to consumers of all abilities and backgrounds."], "last": "Smith", "name": "Mr.", "room": "Liffey B", "gender": "M", "length": "45", "theme": "Theory", "country": "us", "organization": "Anikto LLC", "session_title": "Innovations in Accessibility: What We Can Learn from Digital Outcasts", "first": "Kel", "add_class": "", "job_title": "Principal"}, "85": {"website": "http://codingconduct.cc", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "dingstweets", "time": "14:45:00", "period": "", "entry_id": "85", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["So your client is excited and wants some of that \"persuasive design\" juice for his health application. And you did your homework! You read the books and blogs. You got yourself your \"Mental Notes\" deck and \"Design With Intent\" toolkit. And as you shuffle through the cards with their abundant patterns and principles to influence behavior &#8211; now what? Where to start? Where to focus? What part of the interaction to tackle? Which pattern to choose? And why?", "Interest in design for behavior change has been growing rapidly in interaction design in the past years. In part thanks to that, we now have tools and libraries to inspire our designs. What we are lacking are focus and guidance in applying them. Usually, we get those from user research. But current research methods and deliverables arguably do not provide ready springboards.", "This presentation introduces the Motivation Ability Opportunity (MAA) Model for consumer behavior, nicked from environmental psychology, as a tool to structure user research around a single behavior to be changed, and to guide subsequent design in prioritizing issues to tackle and choose ways to tackle them.", "With practical examples from past client work, the presentation will lay out the model, the research behind it, methods and interview questions to fill it, and how to use it to guide design. Plus you get a handy handout! So the next time your client wants some of that \"persuasive design\" juice, you&apos;ll know \"now what\" to do."], "last": "Deterding", "name": "Mr", "room": "Liffey 1", "gender": "M", "length": "45", "theme": "Behaviour", "country": "de", "organization": "coding conduct", "session_title": "Research for Behavior Change: The MAO Model", "first": "Sebastian", "add_class": "", "job_title": "User Experience Designer"}, "367": {"website": "http://www.madpow.net", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "hawleymichael", "time": "14:30:00", "period": "", "entry_id": "367", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["After several years as a practitioner, you&rsquo;re now managing other interaction designers… As a UX professional, you are naturally empathetic towards others, so your first goal is to be a good manager to each individual. If you were to ask team members what they are looking for in a manager, they would likely say they want someone who encourages learning, offers thoughtful and constructive feedback, gives mentorship based on prior experience, and provides the inspiration and the instruction to grow as a professional (I love this about UXers). However, in addition to supporting the goals of individuals, you also want to empower the UX team as a whole. You want the team to learn how to best work together in a creative environment, what skill sets and experiences various team members bring to the table, and how they can collaborate to create designs that leverage the collective wisdom of the team. A lot to consider. On top of this, design is inherently creative, so educating and mentoring can be a challenge. You can&rsquo;t just give someone a checklist and expect them to use it to navigate the nuances of user goals, business goals, and creative thinking. In this talk I&rsquo;ll present several strategies that you can use to address these challenges. I&rsquo;ll discuss tactics that facilitate individual learning, enable professional development, and create an environment that motivates individuals and teams to find creative solutions to design problems."], "last": "Hawley", "name": "Mr.", "room": "Liffey 2", "gender": "M", "length": "10", "theme": "Strategy", "country": "us", "organization": "Mad*Pow", "session_title": "Core Principles of UX Management: Educating, Mentoring and Inspiring Your Team", "first": "Michael", "add_class": "", "job_title": "Chief Design Officer"}, "309": {"full_name_two": "", "name_two": "", "suffix": "", "twitter": "followsprocess", "period": "", "entry_id": "309", "sponsor": "", "another": "Yes", "job_title_two": "Chief Creative Director", "first_two": "Søren", "last_two": "Muus", "country_two": "dk", "email_two": "sm@fatdux.com", "theme": "Behaviour", "session_title": "Celsius vs. Fahrenheit: Degrees of Difference Between EU and US IxD", "add_class": "", "job_title": "Director of User Experience Design", "website": "http://followsprocess.wordpress.com", "description": ["This presentation aims to identify and explain differences (and similarities) between how interaction design is practiced in the US and Europe. While Europeans have a rich depth of shared cultural references to draw upon amongst narrow groups, Americans tend to share broader, yet more fleeting, contemporary popular references. Shared references shape how mental models are formed, therefore these differences have an effect on how we create and communicate, ultimately influencing the design process as a whole.", "Using anecdotes from their own experiences, the presenters, who practice in Europe and America respectively, will explore how shared references between users, practitioners, and clients influence design processes and practice internationally. Understanding how these differences can inform interaction design will be framed through the lens of cognitive theory and ethnography, providing foundational context for the discussion.", "Attendees can expect to learn about unique cultural factors in process and practice that they can directly apply to their own work, regardless of the country or region where they practice. In addition to gaining a depth of understanding about the global interaction design community, attendees will expand their knowledge of methods for understanding representation and reference."], "session_type": "presentation", "time": "14:35:00", "twitter_two": "sorenmuus", "date": "2012-02-02", "suffix_two": "", "room": "Liffey B", "last": "Deeny", "name": "", "gender": "F", "website_two": "http://www.fatdux.com", "length": "45", "status": "accepted", "gender_two": "M", "biography_two": "Søren is a co-founder of FatDUX along with Thomas Snitker and Eric Reiss, focusing entirely on designing, developing, and deploying great user experiences for clients in both Europe and North America.\\nSøren began his career in the mid-eighties as an Art Director in various agencies, where he specialized in brand development. From the mid-nineties he has practiced interaction design, both on and offline. Today he is Chief Creative Director at FatDUX Copenhagen.\\nSøren is active in the IxD community, is a founding member of European Centre for User Experience, and a member of IAI, UPA, and UX Group Denmark.", "organization": "WebMD Health Services", "country": "us", "organization_two": "FatDUX", "first": "Katey"}, "307": {"full_name_two": "", "name_two": "Ms.", "suffix": "", "twitter": "pixelkated", "period": "", "entry_id": "307", "sponsor": "", "another": "No", "job_title_two": "Co-Founder, Designer & Teacher", "first_two": "Carmen", "last_two": "Dukes", "country_two": "us", "email_two": "carmendukes@gmail.com", "theme": "Process", "session_title": "People ARE Software: The Story of Project: Interaction", "add_class": "", "job_title": "Co-Founder, Designer & Teacher", "website": "http://www.pixelkated.com", "description": ["In 2009 we began with a question: &ldquo;Why isn&rsquo;t anyone teaching interaction design to high school students?&rdquo; We knew we wanted to take on this challenge, but we didn&rsquo;t know how to create such a class. We approached the problem as we would approach any other design problem. We began by researching our &ldquo;users&rdquo; &#8211; students, teachers, principals and education experts &#8211; and developed a curriculum and methodology for teaching design to high school students.", "Through our process of research and prototyping we began to understand what it means to be a teacher. In our classroom, we saw students learning new concepts in a continuous cycle of risk-taking and reflection. We discovered that the way we design the experience of a high school student in a classroom isn&rsquo;t so different from how we design the experience of a software application user. A student&rsquo;s learning cycle maps to the way we expect our users to adopt new behaviors in technology.", "We&rsquo;ll share the story of Project: Interaction, the after school program we created to teach design to high school students. Through the lens of our story we&rsquo;ll show how the definition of interaction design extends beyond technology and how our tools and methods can translate to other practices where human-to-human connection is essential to the experience."], "session_type": "presentation", "time": "14:45:00", "twitter_two": "carmendukes", "date": "2012-02-03", "suffix_two": "", "room": "Liffey 2", "last": "Koch", "name": "Ms.", "gender": "F", "website_two": "http://www.carmendukes.com", "length": "45", "status": "accepted", "gender_two": "F", "biography_two": "Carmen currently works as a digital producer for Hit Entertainment where she is responsible for creating games, apps and websites for global kids brands. Carmen enjoys exploring the intersection of design and business and has a deep interest in creating better user experiences for children’s products and services. She holds a MFA in Interaction Design from The School of Visual Arts and a BA in Film and Media Arts from Temple University. During her time at SVA, she co-founded Project: Interaction, a 10 week after-school program teaching high school students how to use to design to change their communities.", "organization": "Project: Interaction", "country": "us", "organization_two": "Project: Interaction", "first": "Katie"}, "245": {"full_name_two": "", "name_two": "Ms.", "suffix": "", "twitter": "mjbroadbent", "period": "Morning", "entry_id": "245", "sponsor": "", "another": "Yes", "job_title_two": "UX Designer", "first_two": "Eva-Lotta", "last_two": "Lamm", "country_two": "uk", "email_two": "evalottchen@gmail.com", "theme": "Other", "session_title": "Visual Thinking through Sketchnotes", "add_class": "", "job_title": "Principal Consultant", "website": "http://www.mjbroadbent.com", "description": ["Sketchnotes, also known as Visual Notes and closely related to a practice called Graphic Recording, have recently exploded in popularity &#8211; for good reason. Humans are visual thinkers from birth so it&rsquo;s only natural that we are attracted to visual explanations, particularly given the power they have to help solve problems, explore opportunities, and aid in understanding complexity. Sketchnotes &#8211; frequently created during lectures or conferences &#8211; are a technique used to capture concepts in real time with hand-drawn images, words and diagrams.", "Join us for a very special hands-on session to practice your Sketchnoting skills and then put them to use during Interaction12!", "This fast-paced workshop will start with a quick overview of key concepts and then move rapidly through a series of hands-on exercises interspersed with live demonstration, group reviews, and practical critique. This will be a fun and informative session that will equip you with a deeper understanding of how to memorably capture what you hear and see using visual skills.", "Topics covered include:", " &bull; Tools, attributes, and elements of sketchnotes", " &bull; Principles of composition", " &bull; How to listen while drawing (synthesizing versus transcribing)", " &bull; Strategies for translating words into images", " &bull; Resources and practice opportunities for future success", "All skill levels are welcome however you&rsquo;ll get the greatest benefit if you already have rudimentary drawing skills (e.g., stick figures, boxes, arrows, etc.) and even if you tell yourself &ldquo;I can&rsquo;t draw&rdquo; as most people do.", "Materials will be provided. Favorite sketchbooks, pen(s), and/or iPads with sketching apps are also welcome."], "session_type": "workshop", "time": "9:30:00", "twitter_two": "evalottchen", "date": "2012-02-01", "suffix_two": "", "room": "C038", "last": "Broadbent", "name": "Ms.", "gender": "F", "website_two": "http://www.evalotta.net", "length": "180", "status": "accepted", "gender_two": "F", "biography_two": "Eva-Lotta is a freelance UX Designer. She previously headed the business design team at Skype, worked as interaction designer for Yahoo! in London and as lead designer for Kahn + Associates in Paris.\\nBesides her daytime mission of making the web a more understandable, usable and delightful place, she regularly takes sketchnotes at all sorts of talks and conferences and recently turned these into a little book.\\nShe also teaches sketching and runs UX Sketch Club, a monthly(-ish) meetup for people who are interested in experimenting with sketching and sharing their work.", "organization": "MJ Broadbent Design", "country": "us", "organization_two": "Independent", "first": "MJ"}, "246": {"website": "http://www.cxpartners.co.uk/about/people/chui_chui_tan", "status": "accepted", "suffix": "PhD", "session_type": "presentation", "twitter": "ChuiSquared", "time": "14:40:00", "period": "", "entry_id": "246", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["When clients approach us to help them design a digital product (a website or an application) considering user experience, we make recommendations which match the best both user and business requirements.", "Unlike in the digital world, designing a physical product is no longer just about coming out with an interface which is easy to use, or finding the right balance between users and business needs. It gets more complicated than that. It involves other areas such as ergonomics, safety and packaging. You will also ought to work around various constraints and production considerations to achieve a good user experience as well as to optimise its gross margin return of investment. You no longer work solely with designers, developers and business analysts. The decision will have be made involving electronic and software engineers as well as the production team.", "A product could have the most distinctive aesthetic, with the most ergonomic design and provides the best user experience. However, if it is hard to be manufactured, expensive to run or difficult to be serviced, it cannot be considered as a good product.", "Furthermore it is much harder to do an update patch on a physical object than a digital product if you find something is wrong after they are in the production line or out in the market. This presentation discusses the elements that should be taken into consideration when designing for a physical product and how to get the right people involve at the right stage in the design process."], "last": "Tan", "name": "Ms.", "room": "Liffey 1", "gender": "F", "length": "45", "theme": "Strategy", "country": "uk", "organization": "cxpartners", "session_title": "User experience is important but it's not everything: Designing for physical versus digital products", "first": "Chui Chui", "add_class": "", "job_title": "Senior User Experience Consultant"}, "241": {"website": "http://lucidplot.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "lucidplot", "time": "15:45:00", "period": "", "entry_id": "241", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["As interaction designers, organizations are the context for our work.", "And when it comes to the web and other digital channels, organizations are broken. We have a problem.", "However great our interaction design chops are, we can&apos;t sustainably deliver great user experiences that achieve business goals without becoming agents of change. That&apos;s right: to do our work well, we need to help our organizations deal with the huge changes that the internet revolution has created. Management sticking their heads in the sand didn&apos;t work so well over that last 15 years.", "That means we need to leave our comfort zones and step away from our digital tools, to talk to colleagues and clients about the problems they face. Call it service design, multi-channel user experience, or web governance: it comes to the same thing. Does the organization have the key areas of web strategy, governance, execution, and measurement covered?", "In practice, design is the easy part—creating an organizational context for design is what separates the linchpins from everyone else. You're probably an agent of change already. In this session we&apos;ll discuss the context for our work, and how organizational denial about change, silo-centric thinking, and poor governance and strategy lead to disappointing interaction design outcomes. We&apos;ll explore methods to deal with this problem, and share practical ideas for becoming agents of change within our organizations."], "last": "Kahn", "name": "Mr.", "room": "Liffey 1", "gender": "M", "length": "45", "theme": "Strategy", "country": "uk", "organization": "Together London", "session_title": "Interaction Designers as Agents of Change", "first": "Jonathan", "add_class": "", "job_title": "Principal"}, "102": {"website": "http://fredvanamstel.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "fredvanamstel", "time": "14:25:00", "period": "", "entry_id": "102", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["Interaction Design is a young field dedicated to how people interact with technology, but people used to interact without technology way long before it. Kid&rsquo;s street games are one example of what we call Vernacular Interaction Design. Those games have interaction structures that were designed by players themselves across many generations, accumulating a history of successive adaptations for local cultures. By playing those games, children learn how to behave across different social dynamics and, at the same time, update game&rsquo;s representation of those dynamics by according new rules. But this tradition is under threat. Children are spending more time playing videogames than playing street games. That wouldn&rsquo;t be a threat if they could adapt videogame rules by themselves, but currently most videogames don&rsquo;t offer this possibility. Game companies do their best to update their titles, but because they need to operate under mass market rules, they can&rsquo;t innovate much. This cultural stagnation is happening in many other areas of life, tough. Think about social networking, dating, working.", "But Interaction Design can do something about it. Systems can be designed to allow emergent vernacular forms of interactions. Also, old vernacular forms can be revitalized by using them as inspiration for new forms, like Graphic Design did successfully with vernacular typography. This talk will present student works from Faber-Ludens Interaction Design Institute that used children&rsquo;s games as inspiration for designing enjoyable work interactions."], "last": "van Amstel", "name": "Mr.", "room": "Liffey 2", "gender": "M", "length": "10", "theme": "Behaviour", "country": "br", "organization": "Faber-Ludens Interaction Design Institute", "session_title": "Vernacular Interaction Design", "first": "Frederick", "add_class": "", "job_title": "Researcher"}, "38": {"website": "http://www.jeffgothelf.com/blog", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "jboogie", "time": "14:40:00", "period": "", "entry_id": "38", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["Even today, Design is too often perceived as a tactic to simply &ldquo;make things user-friendly.&rdquo; To combat that oversimplification, designers often shroud their work in a mysterious cloud of specialized tools and jargon. This mystery gives designers (of every sort &#8211; visual, UX, interaction, et al) a false perception of value, uniqueness and control over their process and work. In actuality, this self-imposed mystery drives divisions between designers and their teams. Designers need to stop looking at their work in terms of &ldquo;trade secrets&rdquo; and start opening up about their process. Through this transparency, the cloud lifts and the true value of Design becomes clear while designers are revealed to be the indispensable product people they truly are.", "In this session you will learn:", " &bull; Why self-imposed Design mystery makes life as a designer harder", " &bull; How revealing your design secrets leads to more productive, highly collaborative teams", " &bull; How transparency makes you more valuable to your organization", " &bull; How to (finally) convince your colleagues that designers are not just pixel people, but product people", " &bull; 5 tactics for you to immediately begin demystifying Design and increasing your value"], "last": "Gothelf", "name": "Mr.", "room": "Liffey B", "gender": "M", "length": "45", "theme": "Process", "country": "us", "organization": "Proof", "session_title": "Demystifying Design: Fewer Secrets, Bigger Impacts", "first": "Jeff", "add_class": "", "job_title": "Principal"}, "SDC1": {"status": "approved", "room": "Liffey A/B", "session_type": "activity", "theme": "", "length": "90", "entry_id": "SDC1", "sponsor": "", "time": "12:15:00", "date": "2012-02-02", "session_title": "Lunch: Student Design Challenge Update", "description": [""]}, "SDC2": {"status": "approved", "room": "Liffey B", "session_type": "sponsored-activity", "theme": "Announcement", "length": "30", "entry_id": "SDC2", "sponsor": "Thomson Reuters", "time": "9:30:00", "date": "2012-02-03", "session_title": "Student Design Challenge: Winners Accounced", "description": [""]}, "35": {"website": "http://www.normativedesign.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "emenel", "time": "14:25:00", "period": "", "entry_id": "35", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["Ritual has always played an important part in our lives. How do designers tap into the desire for ritual to enhance engagement with products and services? This presentation will ask more questions than it answers in an attempt to start a dialog around the topic within our community. What is it about ritual that is so attractive? How does it manifest in consumer products? When can things become too easy, so easy that they loose their appeal? Is ritual at odds with usability?", "Using examples from our every day life we will begin to explore the nature of ritual interactions and how we can design for them or around them in our products."], "last": "Nish-Lapidus", "name": "Mr.", "room": "Liffey B", "gender": "M", "length": "10", "theme": "Behaviour", "country": "ca", "organization": "Normative Design", "session_title": "Ritual in Interaction Design", "first": "Matt", "add_class": "", "job_title": "Senior Designer"}, "339": {"website": "", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "", "time": "14:35:00", "period": "", "entry_id": "339", "sponsor": "", "another": "No", "date": "2012-02-02", "description": ["In healthcare, we owe it to people to share with them the best information we have about the probable course of a disease as well as the risks and benefits of treatment options. But a number of factors conspire to make this difficult; a history of paternalistic doctor-patient relations, constantly evolving research evidence, a research focus on non-patient important outcomes, fear of emotionally difficult conversations, a lack of research, poor training and misaligned incentives. As it is in many environments, the reality is so much more complex than we imagine. This talk will focus on lessons learned from 6 years of leading the design and development efforts of conversation tools and decision aids with a multidisciplinary team at Mayo Clinic around issues such as diabetes, post-heart attack, hypertrophic cardiomyopathy, depression, smoking, heart disease, osteoporosis and genetic heart disease. The conversations we&rsquo;ve witnessed are a testament to the human ability to deal with complexity and uncertainty and serve as a model for engagement in healthcare and beyond."], "last": "Breslin", "name": "Ms.", "room": "Liffey 2", "gender": "F", "length": "45", "theme": "Context", "country": "us", "organization": "Mayo Clinic", "session_title": "Design for the Unknown: Healthcare and Ambiguity", "first": "Maggie", "add_class": "", "job_title": "Designer/Researcher"}, "BR6": {"status": "approved", "theme": "Break", "room": "", "session_type": "break", "period": "Afternoon", "length": "20", "entry_id": "BR6", "sponsor": "", "time": "15:25:00", "date": "2012-02-04", "session_title": "Break", "add_class": "+ 5min", "description": [""]}, "BR5": {"status": "approved", "theme": "Break", "room": "", "session_type": "break", "period": "Morning", "length": "20", "entry_id": "BR5", "sponsor": "", "time": "10:45:00", "date": "2012-02-04", "session_title": "Break", "description": [""]}, "BR4": {"status": "approved", "theme": "Special Event", "room": "Foyer", "session_type": "sponsored-activity", "period": "Afternoon", "length": "60", "entry_id": "BR4", "sponsor": "HUGE", "time": "15:30:00", "date": "2012-02-03", "session_title": "Happy Hour", "description": ["Silver-level sponsor, HUGE, would like to help us all take a well deserved break during day 2 of the conference in the afternoon. Kick your feet up, strike up a conversation, and enjoy a brew and some snacks to help you through the rest of the day."]}, "BR3": {"status": "approved", "theme": "Break", "room": "", "session_type": "break", "period": "Morning", "length": "20", "entry_id": "BR3", "sponsor": "", "time": "10:45:00", "date": "2012-02-03", "session_title": "Break", "description": [""]}, "BR2": {"status": "approved", "theme": "Break", "room": "", "session_type": "break", "period": "Afternoon", "length": "20", "entry_id": "BR2", "sponsor": "", "time": "15:20:00", "date": "2012-02-02", "session_title": "Break", "description": [""]}, "BR1": {"status": "approved", "theme": "Break", "room": "", "session_type": "break", "period": "Morning", "length": "25", "entry_id": "BR1", "sponsor": "", "time": "11:05:00", "date": "2012-02-02", "session_title": "Break", "description": [""]}, "179": {"website": "http://erova.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "erova", "time": "12:35:00", "period": "", "entry_id": "179", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["Share your prototypes, screen design, sketches or anything else with some of the globe&apos;s finest and motivated participants in the interaction design community to get useful, implementable feedback or to show unique solutions to potentially common design problems.", "We&apos;ll have a round-table discussion where one person tells the group if they need help with a design problem, or if they are sharing a unique solution that&apos;s worked well for them in the past.", "Questions and dialogue from the rest of the group are expected and encouraged.", "Sharing is not mandatory at all; drafts, incomplete work, or past projects are welcome. Time will also be available to discuss how to host UX Show and Tell events in your local design community."], "last": "Avore", "name": "Mr.", "room": "Liffey B", "gender": "M", "length": "80", "theme": "Ecosystems", "country": "us", "organization": "NASDAQ OMX", "session_title": "UX Show and Tell", "first": "Christopher", "add_class": "- 5min", "job_title": "Product Strategist & Designer"}, "69": {"website": "http://www.elisabethhubert.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "lishubert", "time": "14:15:00", "period": "", "entry_id": "69", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["For those of us that like sports, and even for those that don&rsquo;t, we can see many similarities between both athletics and interaction design to learn and grow from. We were told that being a jock would not lead to intellectual success in the real world, but it has been seen that being a sports junkie has helped individuals become even better IxDs than anyone could have imagined. In this session join a self proclaimed jock as she shares lessons from the field (pun intended). We&rsquo;ll discuss how being a jock means understanding not only how to be a great teammate who understands different personalities and skill sets, but also how to be a great motivator, strategist and, at times, leader. Next, we&rsquo;ll relate these characteristics to being the best designer you can by learning how to: work with others (yes, even those pesky marketing folks), motivate others, convince your teams and executives of your design rationale, strategize to see the best design solutions come to light, lead teams to success, and much more. These are the qualities that, learned from personal experiences as an athlete and a designer, have made people more effective in both realms.", "This discussion is designed to take even the most uncoordinated benchwarmer designer to All-Star status. You don&rsquo;t wanna miss it!"], "last": "Hubert", "name": "", "room": "Liffey 2", "gender": "F", "length": "10", "theme": "Theory", "country": "us", "organization": "Independent", "session_title": "How being a jock makes a better Interaction Designer ", "first": "Lis", "add_class": "", "job_title": "User Experience Consultant"}, "250": {"website": "http://www.cpbgroup.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "angel", "time": "14:40:00", "period": "", "entry_id": "250", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["As experience designers, we are increasingly asked to design for social engagement with features like following, commenting, and the critical piece of the viral web; sharing. Tweets, status updates, and content forwards are woven into many of the products and services we use every day, but do we really understand what makes people ~want to share in the first place? You can&rsquo;t just add a button and expect a digital tsunami of shares. Designers, this is where our unique blend of behavioral understanding and design context can translate into magic. Getting people to share can help you spread a particular message, create a community around a topic, or simply gain buzz about something you want to &ldquo;go viral&rdquo; but first you have to design a situation that truly encourages sharing. To get sharing right, you must understand the basic motivations of sharing ~and create a framework appropriate to the context. In this session well examine:", " &bull; The evolution of sharing behavior", " &bull; The 3 main psychological motivations that drive people to share ", " &bull; Companies that get sharing right", " &bull; Guidelines for creating inspired sharing frameworks Ultimately, sharing is good for us as a species. Find out why and discover how to tap the human desire to share to create happier customers, happier users, and a happier you."], "last": "Anderson", "name": "Ms.", "room": "Liffey 2", "gender": "F", "length": "45", "theme": "Behaviour", "country": "us", "organization": "Crispin Porter + Bogusky", "session_title": "Why We Share: Motivations at the Heart of Sharing ", "first": "Angel", "add_class": "", "job_title": "Experience Director"}, "256": {"website": "http://www.animationdynamics.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "goK8", "time": "11:05:00", "period": "", "entry_id": "256", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["Have great research insights and are looking for a visual way to share them? Ethnographic animation is a business tool for your product, design or technology. Learn how animation can be leveraged as a key strategy in communicating human-centered research to decision makers, venture capitalists and customers. Studies have shown that people have a heightened emotional response to animation, so it&apos;s proven to be effective at appealing to diverse consumers. Whether it&rsquo;s shopper behavior, or a task-flow for a new user experience, breathe life into your research and give it a face &#8211; even create virtual prototypes for testing and validation. The UX research team can get end-users involved from the development stage and onwards by collecting their feedback using real-world parameters, such as gravity. Get a comparison breakdown of the advantages of using animation visualization versus video when explaining complex UX data and results, as well as Best Known Methods for the process itself."], "last": "Ertmann", "name": "Ms.", "room": "Liffey 1", "gender": "F", "length": "45", "theme": "Strategy", "country": "us", "organization": "Animation Dynamics", "session_title": "Ethnographic Animation: Using 3D animation as a UX tool for business and education", "first": "Kate", "add_class": "", "job_title": "Owner"}, "602": {"website": "http://www.fabianhemmert.com", "status": "keynote", "suffix": "", "session_type": "keynote", "twitter": "", "time": "10:00:00", "period": "Morning", "entry_id": "602", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["In his keynote address, Fabian Hemmert will present a series of research prototypes from his doctoral thesis, including weight-shifting, shape changing, life-like, whispering, grasping, and even kissing mobile phones. Fabian&apos;s work is much concerned with possible future visions of mobile telecommunication, and with making these future visions experience-able today: Through building actual, physical prototypes."], "last": "Hemmert", "name": "Mr. ", "room": "Liffey B", "gender": "M", "length": "45", "theme": "Dialogue", "country": "de", "organization": "none", "session_title": "Hack to the Future", "first": "Fabian", "add_class": "", "job_title": "Design Researcher"}, "186": {"website": "http://www.possibleworldwide.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "jasonbrush", "time": "14:35:00", "period": "", "entry_id": "186", "sponsor": "", "another": "No", "date": "2012-02-02", "description": ["The predominant aesthetic of user interface design since its advent reflects the ethos of modernist, Bauhaus-inspired architecture and design, shunning decorative adornment in favour of aesthetics determined by utile function. Meanwhile, many leading architects have moved past the principles that guided the seminal architecture of the modernist era — and still inspire interface design — to embrace aesthetic goals outside pure functional form; today&apos;s most influential, progressive buildings are complex structures that balance individualistic, conceptual and expressive goals with their functional purpose. Among the notable architects whose practice breaks with the conventions of modernism is Pritzker-winner Zaha Hadid. Her work — such as BMW&apos;s headquarters and the Guangzhou Opera House— is marked by a sophisticated connection between her buildings and their surrounding environment, often resulting in dramatic, fluid, organic forms that break from the functional simplicity of modernism.", "This talk is an inspiring survey of Hadid&apos;s architecture practice from the perspective of the interaction designer, and uses her work to ask some key questions about the status quo of today&apos;s design aesthetic for interaction and what the future may bring: can interaction design evolve to achieve the types radical forms seen in Hadid&apos;s architecture? If not, why not, and is this a good or bad thing? If so, how so, and what obstacles do interaction designers face? What parallels between architecture and interface design are apropos, and which are not? What inspiring lessons can interaction designers take from Hadid&apos;s work to inform the evolution of their craft?"], "last": "Brush", "name": "Mr.", "room": "Liffey 1", "gender": "M", "length": "45", "theme": "Aesthetics", "country": "us", "organization": "Possible Worldwide", "session_title": "Beyond Modernism: What Interaction Designers Can Learn from the Architecture of Zaha Hadid", "first": "Jason", "add_class": "", "job_title": "EVP, User Experience Design"}, "187": {"website": "http://davemalouf.com/", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "daveixd", "time": "15:40:00", "period": "", "entry_id": "187", "sponsor": "", "another": "No", "date": "2012-02-02", "description": ["This talk will carry from where Dave left off in 2009 when he explored the Foundations of IxD as criteria for coming up with a semantics for critiquing IxD. Dave will review these original theories and dive deeper into an area he only alluded to in the first presentation: Motion.", "Motion has always been a part of interaction, but today more than ever, the types of motions we are being asked to do have greater scale and greater diversity and the very motions we employ are now central to how we differentiate the means of interaction and lead to new aesthetic and semantic phenomena as part of the total experience design.", "The talk then transitions from the theoretical and outlines how this new understanding of motion as an aesthetic of its own requires us to shape the way we practice interaction design differently regardless of platform, but especially when we are working in areas where we are creating new interaction paradigms or working with immature ones."], "last": "Malouf", "name": "Mr.", "room": "Liffey 1", "gender": "M", "length": "45", "theme": "Aesthetics", "country": "us", "organization": "Savannah College of Art & Design", "session_title": "The Aesthetics of Motion in the age of Natural User Interfaces", "first": "Dave", "add_class": "", "job_title": "Professor"}, "508": {"website": "http://www.uxarray.com", "status": "invited", "suffix": "", "session_type": "sponsored-workshop", "twitter": "ssummers", "time": "9:30:00", "period": "Morning", "entry_id": "508", "sponsor": "Microsoft", "another": "No", "date": "2012-02-01", "description": ["Calling all crafty, beguiling technologists! We might not always have budget or time for formal user testing, but don&rsquo;t let that stop you. We&rsquo;ll look at several quick and sneaky techniques for &lsquo;on the fly&rsquo; research, and then put them to the test. We&rsquo;re going to dive into ways to better our bedside manner to achieve more accurate, insightful results and increase our understanding of the users we hope to serve. We&rsquo;ll become UX detectives. This will be an interactive, collaborative, get your hands dirty, workshop experience…No man is an Ireland.", "*Outcomes/Goals:*", "Grow your practical knowledge in observational research; better your awareness, empathy and emotional intelligence, while creating user research scenarios with peers. Participants will walk away with techniques to user test with limited resources and improved test accuracy by reading user verbal and nonverbal cues.", "*Audience:*This is for any designer, ux practitioner, product manager, developer or manager."], "last": "Summers", "name": "", "room": "C026", "gender": "F", "length": "180", "theme": "Process", "country": "us", "organization": "Microsoft", "session_title": "Gumshoe User Research", "first": "Sara", "add_class": "", "job_title": "User Experience Evangelist"}, "506": {"website": "http://userexperience.evantageconsulting.com", "status": "invited", "suffix": "", "session_type": "sponsored-workshop", "twitter": "fred_beecher", "time": "13:30:00", "period": "Afternoon", "entry_id": "506", "sponsor": "Axure", "another": "No", "date": "2012-02-01", "description": ["This hands-on workshop is the perfect chance to learn the tool from a UX and Axure RP expert, Fred Beecher.", "This course is designed for UX professionals who have little to no experience working with Axure RP. Through a series of prototyping exercises, you&rsquo;ll learn how you can use Axure in your current process to build wireframes and interactive prototypes.", "After this session, you&rsquo;ll be well on your way to becoming an Axure Fu master."], "last": "Beecher", "name": "Mr.", "room": "Mac Lab", "gender": "M", "length": "180", "theme": "Process", "country": "us", "organization": "Evantage Consulting", "session_title": "Axure for Newbies: An Intro to Prototyping in Axure RP", "first": "Fred", "add_class": "", "job_title": "Lead User Experience Consultant"}, "507": {"full_name_two": "", "name_two": "Mr.", "suffix": "", "twitter": "andrewcrow", "period": "Afternoon", "entry_id": "507", "sponsor": "GE", "another": "Yes", "job_title_two": "Director of Interaction Design", "first_two": "David", "last_two": "Cronin", "country_two": "us", "email_two": "", "theme": "Ecosystems", "session_title": "GE Design Challenge: Designing the Future of Healthcare Devices", "add_class": "", "job_title": "Director of Visual Design", "website": "", "description": ["At GE, we design and build solutions that address some of the biggest challenges across the world, from healthcare to clean drinking water. One great example of this is the Vscan—a hand-held ultrasound device that brings rapid diagnosis opportunities to doctors everywhere.", "But what if this device did more? What other applications would benefit from mobile healthcare devices and software? Could this become a platform for a variety of healthcare professions in completely new situations?", "Our workshop is an opportunity for GE to share the experience of designing a medical device with some of the world&rsquo;s best interaction designers (you!). But, more importantly, it&rsquo;s a chance for you have a direct impact on the well-being of children, mothers and people in need of medical care. Through a series of exercises, we&rsquo;ll brainstorm and sketch new applications for the Vscan device while solving real-world needs. Each team will have a product engineer at their table, access to the device itself and a chance to compete for fabulous prizes.", "As designers, we all look for opportunities to use our skills to improve the world we live in. We hope you&rsquo;ll join us in this workshop to explore new opportunities for mobile healthcare and work hands-on with fellow interaction designers and engineers. The winning team presents their work to the rest of the Interaction12 Conference at the Opening Night Party as we award some great prizes.", "In this workshop, you will:", " &bull; Work in teams to design new applications for the Vscan", " &bull; Engage directly with the product&rsquo;s engineering team", " &bull; Compete with other teams for a prize (awarded at the opening party)", " &bull; Learn how to navigate the challenges of interaction design for medical devices", " &bull; Stretch beyond web and mobile phone platforms to see how that experience can be used in other fields", "This workshop is suited for designers, developers, and UX professionals interested in exploring new mobile and portable platforms."], "session_type": "sponsored-workshop", "time": "13:30:00", "twitter_two": "davcron", "date": "2012-02-01", "suffix_two": "", "room": "C026", "last": "Crow", "name": "Mr. ", "gender": "M", "website_two": "", "length": "180", "status": "sold-out", "gender_two": "M", "biography_two": "David Cronin is the Director of Interaction Design at GE, where he’s working to bring a human focus to the next generation of digital experiences across GE’s portfolio of products & services from healthcare to transportation. Before GE, David spent 15 years at design firms, including as Director at Smart Design and Managing Director at Cooper. He has a deep background in healthcare user experience and couldn’t be more excited about the topic of the Interaction12 GE Design Challenge.", "organization": "GE", "country": "us", "organization_two": "GE", "first": "Andrew"}, "502": {"website": "http://dirk.knemeyer.com", "status": "invited", "suffix": "", "session_type": "presentation", "twitter": "dknemeyer", "time": "11:55:00", "period": "", "entry_id": "502", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["While we have put men on the moon, mapped the human genome and found cures for various diseases that previously decimated humanity, the scientific, organized understanding of human motivation and behaviour largely remains the undiscovered country. It shouldn&apos;t and, if we have anything to say, it won&apos;t.", "Join Dirk as he diagnoses why and how the essential, internal human condition has been left to wither while external, physical aspects of the world have been developed seemingly beyond the limits of human comprehension. Then, he will illustrate the immense opportunity that now lies before us to revolutionize how we understand ourselves and others, and what impact use of that knowledge can have on us as citizens, designers and marketers."], "last": "Knemeyer", "name": "Mr.", "room": "Liffey B", "gender": "M", "length": "45", "theme": "Dialogue", "country": "us", "organization": "Involution Studios & Sprout, Inc.", "session_title": "Understanding Us: The Next Frontier", "first": "Dirk", "add_class": "", "job_title": "Big Thinker, Relentless Doer, Founder"}, "503": {"website": "www.madpow.net", "status": "replacement", "suffix": "", "session_type": "presentation", "twitter": "DU5TB1N", "time": "11:05:00", "period": "", "entry_id": "503", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["Gamification is the process of applying game design elements to non-game contexts in order to drive user engagement, influence behavior and improve the user experience associated with digital products and services. Over the past year, the practice of gamification has exploded, fueled by marketing hype, media curiosity and spirited debate. While much of the discussion has revolved around extrinsic reward mechanisms as a panacea for customer loyalty and engagement, the most important and effective motivational dynamics of games have been left on the table.", "In this presentation I&rsquo;ll cut through the hype and draw from the fundamentals of game psychology, double-tapping into the techniques game designers use to motivate, engage and guide players through a game&rsquo;s lifecycle. In doing so, I&rsquo;ll lay out a model for architecting user engagement, directing behavior and satisfying the needs of both users and business alike."], "last": "DiTommaso", "name": "Mr. ", "room": "Liffey B", "gender": "M", "length": "45", "theme": "Behaviour", "country": "us", "organization": "Mad*Pow", "session_title": "Beyond Gamification: Architecting Engagement Through Game Design Thinking", "first": "Dustin", "add_class": "", "job_title": "Experience Design Director"}, "AWARDS1": {"status": "approved", "theme": "Special Event", "room": "The Round Room", "session_type": "sponsored-activity", "period": "Evening", "length": "180", "entry_id": "AWARDS1", "sponsor": "Google", "time": "19:30:00", "date": "2012-02-03", "session_title": "IxDA Interaction Design Awards Celebration", "description": ["This year&apos;s conference also plays host to the inaugural presentation of IxDA&apos;s Interaction Awards, the first awards program recognizing excellence across the diverse practice of interaction design.", "Come to the historic Round Room at the Lord Mayor of Dublin&apos;s residence, discover the award winners, toast to the finalists, and celebrate the accomplishments of our discipline."]}, "AWARDS2": {"status": "approved", "suffix": "", "session_type": "sponsored-activity", "period": "", "entry_id": "AWARDS2", "sponsor": "", "date": "2012-02-04", "description": [""], "last": "", "name": "Group", "room": "Liffey B", "country": "us", "length": "30", "theme": "Announcement", "time": "9:30:00", "session_title": "Interaction Awards: Highlights", "add_class": "", "first": "Jennifer Bove"}, "142": {"website": "http://www.leprechaunmuseum.ie", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "leprechaunmuseum_ie", "time": "13:45:00", "period": "", "entry_id": "142", "sponsor": "", "another": "No", "date": "2012-02-02", "description": ["The National Leprechaun Museum.", "A cultural project.", "We explore and imagine the otherworld of Ireland with people in the museum. This is a rich environment and we worked with The Department of Folklore in UCD to deliver the project.", "We aim for high quality engagement with an adult audience in a multisensory environment.", "Culture as product, one that is consumed and created often at the same time and by the same people. Taking a journey through cultural identity, we approach from different directions using a variety of viewpoints and touchpoints. Developing, evolving and communicating the ideas ", "We will explore the 14 spaces we use in the museum and how these are designed to help people imagine the otherworld. ", "How we adapt to user experiences in a realtime environment. I will discuss this approach and how it has developed since we began the project.", "Feed back and innovation, devising feedback capture systems, successes and failures, how these impact on changing the processes and the overall project.", "Engagement and the expectation of enjoyment for all.", "Overall I will explore the context of the topic, the design of the system, and the crafting of experiences. I will look at narratives both internal and external and how these continue to be shaped.", "I encourage audience participation."], "last": "O'Rahilly", "name": "Mr.", "room": "Liffey 1", "gender": "M", "length": "45", "theme": "Aesthetics", "country": "ie", "organization": "National Leprechaun Museum", "session_title": "Imagination and Identity  ", "first": "Tom", "add_class": "", "job_title": "Director"}, "168": {"website": "http://www.rachelhinman.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "hinman", "time": "15:40:00", "period": "", "entry_id": "168", "sponsor": "", "another": "No", "date": "2012-02-02", "description": ["Mobile user experience is a new frontier. Untethered from a keyboard and mouse, this rich design space is lush with opportunity to invent new and more human ways for people to interact with information. Invention requires casting off many anchors and conventions inherited from the last 50 years of computer science and traditional design and jumping head first into a new and unfamiliar design space.", "In this talk, Rachel will provide:", " &bull; Insight into how designers and UX professionals can navigate the unfamiliar and fast-changing mobile landscape with grace and solid thinking.", " &bull; In-depth information on advanced mobile design topics UX professionals will spend the next 10+ years pioneering", " &bull; Tools and frameworks necessary to begin tackling mobile UX problems in this rapidly changing design space."], "last": "Hinman", "name": "", "room": "Liffey B", "gender": "F", "length": "45", "theme": "Ecosystems", "country": "us", "organization": "Nokia", "session_title": "The Mobile Frontier", "first": "Rachel", "add_class": "", "job_title": "Senior Research Scientist"}, "91": {"website": "", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "augustdlr", "time": "10:20:00", "period": "", "entry_id": "91", "sponsor": "", "another": "No", "date": "2012-02-02", "description": ["The world has changed, but design, like so any other institutions, has barely kept pace. This discussion delves into three aspects of contemporary design that depart from 20th century modernity—without ignoring its inherent wisdom. This narrative journey playfully unveils major pillars of contemporary social thought applied to interaction design, touching on a wide array of topics from vampire movies and dance festivals to space aliens and horticulture."], "last": "de los Reyes", "name": "Mr.", "room": "Liffey B", "gender": "M", "length": "45", "theme": "Theory", "country": "us", "organization": "none", "session_title": "Design and the New Modern: Three Things You Should Know", "first": "August", "add_class": "", "job_title": "Design Director"}, "93": {"website": "http://intercom.io", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "destraynor", "time": "11:50:00", "period": "", "entry_id": "93", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["Web software is a gamble. Especially for start-ups who raise millions of dollars, all in the hope that they&apos;ll somehow motivate people to find them, interact, contribute and most importantly stick around for a few years. It&apos;s a high stakes game. On one hand there are apps like Color, Wave, Buzz, which couldn&apos;t motivate even the most die hard of users to regularly update. On the other hand there is Facebook/Twitter/Instagram with millions of users adding content every minute.", "Much is written about acquiring customers online, but in truth that&apos;s only part of the challenge. Motivating them to complete on-boarding, contribute content, and most importantly stick around is the most important piece. As many a site owner knows leaky buckets don&apos;t fill very fast.", "This session will present research, advice and findings from the study of several web applications, and how content and communication contributes to their success. Attendees will leave better equipped to design applications, and maintain good customer communications during the crucial early days of an application&apos;s life."], "last": "Traynor", "name": "Mr. ", "room": "Liffey 2", "gender": "M", "length": "45", "theme": "Context", "country": "ie", "organization": "Intercom", "session_title": "Communication & Content in Web Software: Bringing Customers from Like to Love", "first": "Des", "add_class": "", "job_title": "User Experience Lead & Chief Operating Officer"}, "224": {"website": "http://arielwaldman.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "arielwaldman", "time": "11:55:00", "period": "", "entry_id": "224", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["From hearing particle collisions to discovering distant galaxies: how people are creating unexpected interfaces for open source space exploration and science.", "Science should be disruptively accessible &#8211; empowering people from a variety of different backgrounds to explore, participate in, and build new ways of interacting with and contributing to science. There has been a considerable movement in the last several years to make science more open between scientific disciplines and to the perceived &ldquo;public&rdquo;. But simply making science open &#8211; by placing datasets, research, and materials online and using open source licensing &#8211; is only half the battle. Open is not the same as accessible. Often the materials are very cryptic or are buried deep within a government website where they&rsquo;re not easy to find. It&apos;s not until someone builds an interface to these open datasets that they truly become accessible and allow for hundreds of thousands of people to actively contribute to scientific discovery."], "last": "Waldman", "name": "", "room": "Liffey 1", "gender": "F", "length": "45", "theme": "Other", "country": "us", "organization": "Spacehack.org", "session_title": "Hacking Space Exploration and Science", "first": "Ariel", "add_class": "", "job_title": "Open Science Strategist + Interaction Designer"}, "95": {"website": "http://whatsthehubbub.nl", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "kaeru", "time": "13:55:00", "period": "", "entry_id": "95", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["Both pigs and humans have a reputation for being intelligent. Despite this, it seems neither pigs nor humans are able to exercise their cognitive abilities to the fullest in their modern environments.", "Farmed pigs in the European Union are required to have access to &lsquo;enrichment materials&rsquo;. These encourage pigs to perform their (natural) behavior, reduce boredom and tail biting, and, hence, reduce the need for tail docking. This legal requirement has led farmers to provide materials such as a plastic ball or a metal chain with some plastic piping. However, these &lsquo;toys&rsquo; for the most part neither resolve societal concerns nor do they appeal to the cognitive abilities of the pigs.", "To allow for a more interesting development of (human and animal) behavior, and to learn more about some of the processes involved, a team of play designers and animal researchers joined together at the Design for Playful Impact research group of the Utrecht School of the Arts, to design a game challenging the cognitive abilities of both pigs and humans. In the game, play between species happens in real-time, using custom hardware in pigs&rsquo; farm pens and bespoke software for commercial mobile devices on the human side.", "In this session, Kars Alfrink, one of the team&rsquo;s designers, will demo the game and show how it evolved over time, using numerous examples taken from the project&rsquo;s ongoing process including field research at farms, participatory design sessions and playtests with pigs and humans and the production of a concept video."], "last": "Alfrink", "name": "Mr.", "room": "Liffey 2", "gender": "M", "length": "10", "theme": "Ecosystems", "country": "nl", "organization": "Hubbub", "session_title": "Designing play for pigs and humans", "first": "Kars", "add_class": "", "job_title": "Chief Agent"}, "94": {"website": "http://danlockton.co.uk", "status": "sold-out", "suffix": "", "session_type": "workshop", "twitter": "danlockton", "time": "9:30:00", "period": "Morning", "entry_id": "94", "sponsor": "", "another": "No", "date": "2012-02-01", "description": ["Whether we choose to do it or not, what we design is going to affect how users behave, so we might as well think about it, and — if we can—actually get good at it. A systems approach can help us understand how people interact with the different products and services they experience, how mental models and cognitive biases and heuristics influence the way people make decisions about what to do, and hence how we might apply that knowledge (for good).", "In this practical workshop, we&rsquo;ll first try a novel investigatory approach to design and behaviour, using ourselves as both designers and 'guinea pigs' in exploring the different ways in which designers model users when seeking to influence behaviour, how users respond, and how better to uncover users' understanding, mental models and heuristics. We will explore the possibilities of constructing behavioural personas, and what insights these could offer.", "Then, using a structured &apos;systems' approach, together with the latest iteration of the Design with Intent toolkit, we&apos;ll tackle a behaviour change case study, generating and developing concepts for influencing user behaviour which better match—and even help improve—users' understanding in the process of changing how they act."], "last": "Lockton", "name": "Mr.", "room": "C030", "gender": "M", "length": "180", "theme": "Behaviour", "country": "uk", "organization": "University of Warwick & Brunel University", "session_title": "Design with Intent: Understanding users and influencing behaviour", "first": "Dan", "add_class": "", "job_title": "Research Fellow & Lecturer in Design"}, "163": {"website": "http://Abbytheia.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "Abby_The_IA", "time": "11:05:00", "period": "", "entry_id": "163", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["No one would think it delightful to see a beautifully rendered building fall under its own weight. To avoid such occurrences, Architects don&rsquo;t just provide a holistic design for a space, they also assure that the space is structurally sound and can support the expected usage and growth of its &ldquo;users&rdquo;. Interaction design is a similar: build a weak structure and even the most delightful content and function will fail to deliver satisfaction. And we have all experienced beautiful designs that fail. Everyday actually.", "By taking strategic steps towards providing structural strength within our digital spaces we can make the world a better place for everyone.", "The focus of this talk will be on what an interaction designer really needs to know to evaluate the strength of their design solutions. The goal being to create a better understanding of the value that great information architecture can bring to the creative process."], "last": "Covert", "name": "Ms", "room": "Liffey 2", "gender": "F", "length": "45", "theme": "Context", "country": "us", "organization": "The Understanding Group", "session_title": "Does it have legs? Information Architecture Heuristics for Interaction Designers", "first": "Abby", "add_class": "", "job_title": "Information Architect"}, "M4": {"status": "approved", "room": "Liffey A", "session_type": "break", "theme": "Meal", "length": "30", "entry_id": "M4", "sponsor": "", "time": "9:00:00", "date": "2012-02-04", "session_title": "Breakfast & Coffee", "description": [""]}, "M10": {"status": "approved", "room": "Liffey B", "session_type": "activity", "theme": "Announcements", "length": "10", "entry_id": "M10", "sponsor": "", "time": "16:35:00", "date": "2012-02-04", "session_title": "Interaction13 Chairs", "description": [""]}, "605": {"website": "http://www.dunneandraby.co.uk/content/projects", "status": "keynote", "suffix": "", "session_type": "keynote", "twitter": "DI__RCA", "time": "16:30:00", "period": "Afternoon", "entry_id": "605", "sponsor": "", "another": "No", "date": "2012-02-02", "description": ["TBD"], "last": "Dunne", "name": "Mr.", "room": "Liffey B", "gender": "M", "length": "45", "theme": "Dialogue", "country": "ie", "organization": "Royal College of Art in London", "session_title": "What if... crafting design speculations", "first": "Anthony", "add_class": "", "job_title": "Professor & Head of the Design Interactions Programme"}, "604": {"website": "", "status": "keynote", "suffix": "", "session_type": "keynote", "twitter": "", "time": "16:45:00", "period": "Afternoon", "entry_id": "604", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["TBD"], "last": "Bell", "name": "Dr.", "room": "Liffey B", "gender": "F", "length": "45", "theme": "Context", "country": "au", "organization": "Intel Labs", "session_title": "TBD", "first": "Genevieve", "add_class": "", "job_title": "Anthropologist & Researcher"}, "153": {"full_name_two": "", "name_two": "Mr.", "suffix": "", "twitter": "", "period": "", "entry_id": "153", "sponsor": "", "another": "Yes", "job_title_two": "Design Lead", "first_two": "Christian", "last_two": "Drehkopf", "country_two": "de", "email_two": "christian.drehkopf@iconmobile.com", "theme": "Ecosystems", "session_title": "A Connected Mobile World", "add_class": "", "job_title": "Design Lead", "website": "http://www.iconmobile.com", "description": ["In an ever more connected world we believe that not longer a single entity defines a true customer experience. Not a sole product&apos;s feature set, interface or service proposition defines it&apos;s real value for the people using it, but it&apos;s emplacement in a vivd ecosystem of transferable content, information and personal data. The experience is rather defined by the rules and regulations between the consumer&apos;s relevant products in a connected system with an designed overarching layer of tangiblized data. We therefore think that in the future the design of these exact touchpoints between products will be even more important for the consumer than a single interface entity.", "Especially in the mobile world an application&lsquo;s behavior is determined by device capabilities, data connectivity, periphery accessories and software frameworks that live outside the actual product. Looking at Samsung&apos;s AllShare, Apple&apos;s iDevices and, more recently, at the attempts of the automotive industry, we see that the true power does not lie in the sophisticated design of the single product but in the transferability and seamless connectivity between screens, input devices and data processing services.", "In this presentation we will analyze current experience ecosystems with an emphasis on mobile contexts. By looking into the building block of carefully designed ecosystems we line out guidelines and recommendations for designers to build better connected systems. This talk is especially for professionals in the experience industry, designers, managers and engineers as well as for everyone involved in the innovation and production process of digital and mobile products."], "session_type": "presentation", "time": "15:40:00", "twitter_two": "", "date": "2012-02-02", "suffix_two": "", "room": "Liffey 2", "last": "Kueber", "name": "Mr.", "gender": "M", "website_two": "http://www.iconmobile.com", "length": "45", "status": "accepted", "gender_two": "M", "biography_two": "Christian is a design expert with in-depth expertise in planning, executing and using qualitative research to shape strategies that focus on mobile innovation. He combines an outstanding analytical ability to gain comprehensive understanding of people´s needs with the sensibility and empathy of a designer to form meaningful, holistic user experiences. In 2008 Christian joined iconmobile where he is responsible for launching and accelerating international user-centered research programs for well known companies, such as Nokia, Samsung and BMW. ", "organization": "iconmobile", "country": "de", "organization_two": "iconmobile", "first": "Thomas"}, "601": {"website": "http://www.disruptive-thinking.com", "status": "keynote", "suffix": "", "session_type": "keynote", "twitter": "lukegwilliams", "time": "9:30:00", "period": "Morning", "entry_id": "601", "sponsor": "", "another": "No", "date": "2012-02-02", "description": ["TBD"], "last": "Williams", "name": "Mr.", "room": "Liffey B", "gender": "M", "length": "45", "theme": "Other", "country": "us", "organization": "Frog Design", "session_title": "Disrupt", "first": "Luke", "add_class": "", "job_title": "Author, Professor & Fellow"}, "600": {"website": "http://about.me/caseorganic", "status": "keynote", "suffix": "", "session_type": "keynote", "twitter": "caseorganic", "time": "16:30:00", "period": "Afternoon", "entry_id": "600", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["We are tool using creatures. Prosthetics touch almost every part of our lives. Until recently, humans have used their hands and bodies to interface with objects. Early interfaces were solid and tactile. Now, the interface can be anywhere. The best interfaces compress the time and space it takes to absorb relevant information, and the worst cause us car accidents, lost revenue, and communication failures. We increasingly live on interfaces, and it is their quality and design which increases our happiness and our frustration.", "This speech will discuss how the field of anthropology can be applied to interface design, and how future interfaces, such as the ones employed by augmented reality, will change the way we act, feel and communicate with one another.", "Topics in the speech will include:", " &bull; Superhuman interaction design", " &bull; Augmented and diminished reality", " &bull; Calm computing", " &bull; New and Invisible Interfaces", " &bull; Mental fragmentation", " &bull; and other physiological effects of computing.", "* Interfaces and objects as prosthetics and their effect on our nervous systems &amp;8211; the extension of our nervous system into digital interfaces."], "last": "Case", "name": "Ms.", "room": "Liffey B", "gender": "F", "length": "45", "theme": "Context", "country": "us", "organization": "none", "session_title": "From Solid to Liquid to Air: Interaction Design and the Future of the Interface", "first": "Amber", "add_class": "", "job_title": "Cyborg Anthropologist & User Experience Designer"}, "603": {"website": "", "status": "keynote", "suffix": "", "session_type": "keynote", "twitter": "", "time": "10:00:00", "period": "Morning", "entry_id": "603", "sponsor": "", "another": "No", "date": "2012-02-03", "description": ["What is a \"designerly way of working\"? In my view, the core elements of design are to investigate possible futures, to address all aspects of quality in parallel (think aesthetics and utility), to grow an understanding of the &ldquo;problem&rdquo; by developing attempts to &ldquo;solve&rdquo; it, and to think through sketching and other tangible forms of representation.", "In interaction design practice, I find that a designerly stance based on the elements outlined above most often manifests itself in Exploring and Sketching.", "Exploring as in assuming that there is a wide space of possible designs ahead of us, and we need to learn about its topology to know where the most promising directions are. Moreover, we can involve users in exploring the possibilities together, rather than merely asking them about the point in the space they currently inhabit.", "The main vehicle for exploration is Sketching, where possible designs are materialized in ways that are specific enough to assess their qualities, yet lightweight enough to be disposable. Sketching interaction design comes with a set of particular challenges, since the essence of the sketched idea is nearly always in its temporal properties &amp;#8211; how the interaction unfolds over time.", "In this keynote, I will examine Exploration, Sketching and other designerly ways of working in interaction design practice, illustrate them by means of examples and assess them in relation to professional standards."], "last": "Löwgren", "name": "Mr.", "room": "Liffey B", "gender": "M", "length": "45", "theme": "Theory", "country": "se", "organization": "School of Arts & Communication at Malmö University", "session_title": "Exploring, sketching and other designerly ways of working", "first": "Jonas", "add_class": "", "job_title": "Co-founder & Professor of Interaction Design"}, "156": {"website": "http://www.backgroundstories.com/", "status": "accepted", "suffix": "", "session_type": "workshop", "twitter": "aBirt", "time": "9:30:00", "period": "Morning", "entry_id": "156", "sponsor": "", "another": "No", "date": "2012-02-01", "description": ["The topic of sustainability is increasingly a part of business dialogue and consumer focus.", "But how do consumers interact with topics related to sustainability, and how can designers facilitate the understanding of, and interaction with complex sustainability data?", "Whether you are a eco-newbie or a seasoned expert in LCA (Life Cycle Analysis: a form of ecological accounting), you will learn techniques on how to structure this information and enable people to interact with it. By the end of the workshop, you&rsquo;ll have a better understanding how to put sustainability content into context.", "This workshop will explore information design-oriented techniques to communicating sustainability to consumers. We&rsquo;ll focus on narrative and storytelling approaches to communicating sustainability in visual and interactive ways.", "Participants will walk away with a better understanding of a narrative and user-friendly approach to designing this information. During this ½-day workshop we will cover:", " &bull; An overview of the world of sustainability", " &bull; The variety of sustainability data that exists ", " &bull; Methods for structuring information on sustainability", " &bull; Creative and real-world examples of good (visual &amp; interactive) communication on sustainability", " &bull; Highlights from consumer research: &lsquo;How do consumers understand sustainability?&rsquo;", " &bull; Tips and techniques of information design, data visualization and &lsquo;visual storytelling&rsquo;", "The workshop will end with us focusing on specific scenarios brought by participants."], "last": "Birt", "name": "Ms.", "room": "C036", "gender": "F", "length": "180", "theme": "Ecosystems", "country": "be", "organization": "Background Stories", "session_title": "‘Visual Storytelling’ to Communicate Sustainability", "first": "Arlene", "add_class": "", "job_title": "Visual Storyteller & Info Designer"}, "550": {"status": "planned", "theme": "Leadership", "room": "C017", "session_type": "sponsored-workshop", "period": "Morning", "name": "Group", "length": "180", "entry_id": "550", "sponsor": "IxDA", "time": "9:30:00", "date": "2012-02-01", "session_title": "IxDA Local Leader Workshop", "first": "IxDA Board & Regional Coordinators", "add_class": "", "description": ["Are you already an IxDA Local Leader? Do you want to lead an IxDA Local Group? If so, come join us at the annual Local Leaders Workshop. Get together with your fellow Local Leaders to discuss strategies for designing a passionate IxDA community in your area. You will walk away with new event ideas and a fresh perspective.", "The discussion will be structured with a mix of topics on community presented by a variety of Local Leaders. Also, we will spend part of the time discussing the each region&apos;s events, successes and challenges. Our goal is to make this discussion as virtual as possible so we can include all of the local leaders from around the world!"]}, "231": {"full_name_two": "", "name_two": "Mr.", "suffix": "", "twitter": "mattmorphett", "period": "", "entry_id": "231", "sponsor": "", "another": "Yes", "job_title_two": "User Experience Architect", "first_two": "Shane", "last_two": "Morris", "country_two": "au", "email_two": "shane@automaticstudio.com.au", "theme": "Process", "session_title": "Switching On My Ears", "add_class": "", "job_title": "Senior User Experience Designer", "website": "http://www.amberdew.com.au", "description": ["Designing a hand-held device presents a number of challenges. Designing that device for use by folks with impaired physical abilities introduces another layer of complexity. Ensuring that the experience is appropriate for an audience from five year-old kids to ninety five year-old retirees controlling one of their senses is just downright difficult.", "Matt &amp; Shane recently worked with Australian innovator and international success story Cochlear to design device to help bionic ear implant recipients monitor and control their hearing. The design represented an evolution to a simpler more usable device.", "Particular attention is given to:", " &bull; Design artefacts: wireframes and screen mock-ups showing evolution from early design concepts through refined user interface.", " &bull; The full UX lifecycle including; ethnographic research, iterative design cycles and usability testing with Cochlear implant recipients.", " &bull; The approach taken to coordinate design exercises across multiple teams including; industrial design, ergonomics, electronics, software design, graphic design and small-screen user interface design.", " &bull; The delicate balance required when attempting to improve user experience without completely confounding the expectations of a large and vocal existing user-base.", "The objective of this case study is to provide conference delegates with genuine insight into the design process by exposing the methods and also by showing the actual designs at various points of their development.", "Along the way, we detail the pitfalls encountered and outline the practical solutions that were applied. Processes and lessons learned are applicable across UX projects of all types, not just mobile and hand-held product design projects."], "session_type": "presentation", "time": "15:45:00", "twitter_two": "shanemo", "date": "2012-02-04", "suffix_two": "", "room": "Liffey B", "last": "Morphett", "name": "Mr.", "gender": "M", "website_two": "http://www.linkedin.com/in/shanemo", "length": "45", "status": "accepted", "gender_two": "M", "biography_two": "Shane Morris is one of Australia’s most respected user experience professionals. Through consulting, mentoring and training he has helped organisations create compelling digital experiences since 1991. He has worked on desktop applications, internet applications, mobile user interfaces, physical devices and web sites. Shane has taught user experience topics around the world and is a key contributor to “101 Things I Learned in Interaction Design School” at ixd101.com. Shane has worked with companies like Tennis Australia, Microsoft, Lonely Planet, M&C Saatchi, Cochlear, Amnesia Razorfish and Qantas - helping creative and technical professionals collaborate to create services that empower, inspire and reward.", "organization": "Amberdew", "country": "au", "organization_two": "Automatic Studio", "first": "Matt"}, "41": {"website": "http://www.intel.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "", "time": "11:05:00", "period": "", "entry_id": "41", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["The rings on a tree, the strata on earths crust, the pedals of a flower, the depth of clutter on your desk, even the lines on your face all tell a story. These details when viewed in the organisms whole give the viewer a history as well as an indication of well being. As members of society and mother nature, we all inherently understand how the fresh new green buds on a plant indicate growth and the older weathered look of a tree trunk gives indication of a harsh winter. These are things built into understanding of the world. We as designers can take advantage of this natural &ldquo;visual affordance&rdquo; and develop a user experience that is can convey large amounts of information that is easily understandable.", "I have developed a user interface that takes advantage of biomimic techniques and delivers complex data sets in an easily understood way. In user testing of this prototype users were able to see data trending they didn&rsquo;t notice previously and were able to quickly understand over all conditions.", "I would like to talk about biomimic techniques in general and how I have applied them. I&rsquo;ll give overview of user needs (why I created it) the tools techniques I used to create it, show it running on different platforms and the way it will quickly digest and display any data set formatted in XML. I&rsquo;ll end with user feedback and next steps. i have a video clip of me speaking large group too"], "last": "Denman", "name": "Mr.", "room": "Liffey B", "gender": "M", "length": "45", "theme": "Behaviour", "country": "us", "organization": "Intel", "session_title": "Biomimic Infographic", "first": "Pete", "add_class": "", "job_title": "User Experience Designer"}, "147": {"full_name_two": "", "name_two": "Ms.", "suffix": "", "twitter": "michael_smyth", "period": "", "entry_id": "147", "sponsor": "", "another": "Yes", "job_title_two": "Researcher", "first_two": "Ingi", "last_two": "Helgason", "country_two": "uk", "email_two": "i.helgason@napier.ac.uk", "theme": "Theory", "session_title": "Critical Design: Restoring a sense of wonder to Interaction Design", "add_class": "", "job_title": "Reader", "website": "http://www.michael-smyth.co.uk", "description": ["Will the promise of Critical Design deliver after the disappointment of ethnography? Interaction Designers expected ethnography to reveal rich insights that would inform the creation of better products, services and experiences. However the pressure of solution-focused design practice turned out to be a poor fit with ethnography&rsquo;s concern with meaning and cultures. In response, Critical Design is emerging as a new strategy for exploring the space that lies tantalisingly beyond the current and the now.", "At the core of ethnography is observation and therein lies the appeal to Interaction Designers. The disappointment has been in the failure to translate from the rich descriptive picture of ethnography into the generation of requirements. This expectation reveals a misunderstanding as to the purpose of ethnography. Ethnography uncovers meaning, it does not identify problems or solutions. Interaction Designers have responded by taking a more &lsquo;designerly&rsquo; approach to requirements generation by considering both the problem and the solution in a more fluid and intertwined manner. In this vein, Critical Design presents design as a catalyst or provocation for thought. Through &lsquo;design fictions&rsquo; the approach attempts to challenge assumptions and preconceptions about the role that products and services play in everyday life. A series recent of workshops will be discussed that have blended aspects of ethnography and Critical Design to identify the future paradigms of interaction in the urban environment."], "session_type": "presentation", "time": "11:50:00", "twitter_two": "urbanixd", "date": "2012-02-04", "suffix_two": "", "room": "Liffey B", "last": "Smyth", "name": "Dr.", "gender": "M", "website_two": "http://complexpleasures.wordpress.com/about-me/", "length": "45", "status": "accepted", "gender_two": "F", "biography_two": "Ingi Helgason is studying towards a PhD in Interaction Design at Edinburgh Napier University, where she also works as a lecturer in interactive media design, and a researcher in the field of pervasive computing.\\nWith a background in graphic and visual communication, her research interests focus on investigating interactions with new-media art installations, and technology-mediated social interactions in public and urban spaces. Her current teaching covers contextual design, and technology design and innovation. An active member of the executive committee of the Create series of IxD conferences, Ingi has recently joined the program committee of the BCS HCI conference for 2012. She is one of the organisers of This Happened Edinburgh, a series of events focusing on the stories behind interaction design.", "organization": "Centre for Interaction Design, Edinburgh Napier University", "country": "uk", "organization_two": "Centre for Interaction Design, Edinburgh Napier University", "first": "Michael"}, "205": {"website": "http://www.heyfinley.com/", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "jpfinley", "time": "14:10:00", "period": "", "entry_id": "205", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["When you think about the design of your product or service, what comes to mind? Is it the color scheme, the layout of the navigation, or the smoothness of the animation? What about&hellip; how it sounds?", "As humans, our ability to perceive and identify sound is powerful, but typically underutilized by the products we use. Mediums like film and video games have long harnessed the emotional and psychological powers of the aural channel, while many products and services today seem to miss the mark.", "Since so much of what we design communicates visually, it can be easy to ignore our ears. But when used effectively, sound can close the feedback loop just as good as anything else, whether it&apos;s exposing the state of an application, identifying the boundaries of behavior, or rewarding an action.", "In this talk, we&apos;ll examine the role of sound in interaction design, the kinds of sounds that make sense, and the times when you should use this exceptional feedback channel to create a positive user experience."], "last": "Finley", "name": "Mr.", "room": "Liffey B", "gender": "M", "length": "10", "theme": "Aesthetics", "country": "us", "organization": "none", "session_title": "Interacting with Sound", "first": "John", "add_class": "", "job_title": "Interaction Designer"}, "204": {"full_name_two": "", "name_two": "Mr.", "suffix": "", "twitter": "daveixd", "period": "Full-day", "entry_id": "204", "sponsor": "", "another": "Yes", "job_title_two": "Senior Designer", "first_two": "Matt", "last_two": "Nish-Lapidus", "country_two": "ca", "email_two": "mattnl@gmail.com", "theme": "Process", "session_title": "What you missed when you skipped design school", "add_class": "", "job_title": "Professor", "website": "http://davemalouf.com/", "description": ["Many interaction design practitioners followed organic career paths that allowed then to forgo formal design education, either because such education wasn&apos;t meaningful when they entered the field, or because they decided for good reasons to look elsewhere (HCI, Library Sciences, etc). By skipping design school they miss learning some key foundations of design practice such as criticism, theory, and the studio. They also miss a great experience to learn from experienced designers with their peers.", "In this practice-based workshop, you will participate in exercises centered around core concepts in design. The workshop will help you experience, if just for a short while, what happens in a design school and how you can start filling these gaps without getting a Master of Fine Arts.", "The workshop will cover four main topics:", " &bull; *Creative &amp; Visual Thinking:* Learn how to process and analyze creativity from the designer&apos;s perspective &#8211; moving first from imagination, then towards analysis.", " &bull; *Art:* Yup, that&apos;s right, we are going to make art. Whether that art is in pixels or construction paper, every design student has to take courses in expressive media such as paint, 3D graphics, or photography. This offers the student new processes for creativity that help them work fluidly in their medium, rather than struggling to control it.", " &bull; *Criticism &amp; Critical Analysis:* Often designers are accused of saying they like things \"just because.\" This happens because people they lack a shared vocabulary to discuss the work at hand. Design criticism helps students learn how to discuss design with other their clients and peers. This section will look at key concepts in theory, criticism, and analysis that are used by many designers regardless of medium.", " &bull; *The Studio:* The studio is not a workshop (though it can take place in one). It is a philosophical construct that takes up both space and people&apos;s awareness. A transparent work environment, criticism and collaboration are just some of the concepts that make up a studio environment.", "Learning the foundation of these four areas will not only help you improve your own practice, but also your ability to collaborate with other designers and express your designs to clients and coworkers. Join us for a one day immersion in design school!"], "session_type": "workshop", "time": "9:30:00", "twitter_two": "emenel", "date": "2012-02-01", "suffix_two": "", "room": "C040", "last": "Malouf", "name": "Mr.", "gender": "M", "website_two": "http://blog.emenel.ca/", "length": "420", "status": "accepted", "gender_two": "M", "biography_two": "Matt Nish-Lapidus is a senior designer at Normative Design in Toronto. Matt’s background in new media art, music, and design has enabled him to practice interaction design and related disciplines for over 10 years across a number of industries. He has worked for large clients such as Coca-Cola, as well as helped start-ups design and launch new products. Matt is currently serving on the board of directors for the Interaction Design Association (IxDA) and was a founder of IxDA Toronto.", "organization": "Savannah College of Art & Design", "country": "us", "organization_two": "Normative Design", "first": "Dave"}, "148": {"website": "http://www.vitaminsdesign.com", "status": "accepted", "suffix": "L", "session_type": "presentation", "twitter": "adrianwestaway", "time": "15:45:00", "period": "", "entry_id": "148", "sponsor": "", "another": "No", "date": "2012-02-04", "description": ["This session plans to inspire and awaken the practice of user centered design throughout the design process. It will focus on our award winning project, Out of the Box, which was an open collaboration between Vitamins, Samsung and the Helen Hamlyn Centre in London. The work is currently on show at the MoMA.", "The project goal was to design new methods of engaging older users to use existing smartphone technologies. Rather than redesign a dumbed down &ldquo;special&rdquo; phone we actually redesigned the experience around receiving a phone &#8211; focusing on the out of box learning experience. We developed novel research methods which we will explain in great detail &#8211; showing how to understand and create relevant solutions to real life problems. We will explain how we used custom research tools, like bananas, to find insights and explain how we translated those insights into real concepts, fast prototypes and final products.", "This talk is of interest to anyone who wants to create more relevant design solutions, and get closer to their users &#8211; focusing on older people engaging with technology. We have been touring this talk privately, and at the IxDA in New York over the last year and are now making all of the research public. Adrian Westaway will present the talk, it will be a fun, engaging and valuable insight into the workings of a multidisciplinary design and invention company in collaboration with a major international client."], "last": "Westaway", "name": "Mr.", "room": "Liffey 2", "gender": "M", "length": "45", "theme": "Process", "country": "uk", "organization": "Vitamins", "session_title": "Bananas, Technology, and Magic: Breaking the cliches of user centered design", "first": "Adrian", "add_class": "", "job_title": "Director, Technology & Magic"}, "350": {"website": "http://www.poetpainter.com", "status": "accepted", "suffix": "", "session_type": "workshop", "twitter": "stephenanderson", "time": "13:30:00", "period": "Afternoon", "entry_id": "350", "sponsor": "", "another": "No", "date": "2012-02-01", "description": ["Ready access to information is great. But many times there is too much information, too much data, or too many options to make sense of. People can easily become frustrated or disengage if they can&rsquo;t connect with what is presented to them.", "Stephen Anderson, designer and creator of the Mental Notes card deck, believes that people must be emotionally engaged if you want them to exhibit a certain behavior. In this workshop, Stephen will share the process he uses to create simple visual representations to help people make informed choices and understand complex information.", "In brief, design patterns such as spreadsheets, lists, dashboards and grid views suffice for getting data onto a screen. However, when it comes to making sense of this data, these same patterns hold us back from designing great experiences; generic patterns arepoor substitutes for a good custom visualization, especially one designed for the content being displayed. Stephen will share with you many examples of such visualizations, and the process used to design each. Topics will include:", " &bull; How to construct interactive models that make sense of complex information", " &bull; Basic graphic design skills that can used by anyone (and how to avoid simply &ldquo;dressing up data&rdquo;)*", " &bull; The challenges of visualizing dynamic information, and how this differs from data visualizations and infographics", " &bull; How to use metaphor and story to make sense of complex information", " &bull; The neuroscience behind perception and judgement", " &bull; And much more!", "Examples cover a variety of topic areas, such as: Health Insurance plans, medical charts, eCommerce search results, flight times, sales and CRM data, mobile phone bills, recipes, pirated movies, academic research, shopping lists and so on.", "In addition to the many numerous information visualization examples, most of which will be new to attendees, there will be multiple hands-on exercises where you will practice the skills being taught.", "Information is ripe for a makeover. This workshop will show you useful &amp; engaging ways to present information.", "* No graphic design skills are required!"], "last": "Anderson", "name": "Mr.", "room": "C030", "gender": "M", "length": "180", "theme": "Behaviour", "country": "us", "organization": "PoetPainter", "session_title": "The Quest for Emotional Engagement", "first": "Stephen", "add_class": "", "job_title": "Independent Consultant"}, "359": {"website": "http://www.goinvo.com", "status": "accepted", "suffix": "", "session_type": "presentation", "twitter": "eadahl", "time": "10:20:00", "period": "", "entry_id": "359", "sponsor": "", "another": "No", "date": "2012-02-02", "description": ["The products and services we design and deploy are embedded within a culture and not just a context. Culture is an important concept that is often overlooked by designers. We need to think beyond user&apos;s goals, needs, desires, emotions, context, psychology and principles of design; we need to start designing from a place of culture.", "This talk explores how cultural understanding can inform design as well as how our designs impact the cultures that use them. I define culture in terms of design and build a framework designers can use to better understand culture and it&rsquo;s implications on their design work. Designers will walk away from this talk with basic cultural literacy and the tools to incorporate cultural understanding into their design process. I will also show the impact the products and services we design have on cultures.", "Ultimately, design (even if data and pattern driven) is subjective and we bring our own historical trajectory to our designs. Having a deeper understanding of culture will have a direct impact on what we bring to our design decisions.", "More broadly, as a design profession we need to be expanding our discourse to include culture and cultural theory into our understanding of interactions, experiences and design."], "last": "Dahl", "name": "Mr.", "room": "Liffey 1", "gender": "M", "length": "45", "theme": "Other", "country": "us", "organization": "Involution Studios", "session_title": "Cultural Design", "first": "Erik", "add_class": "", "job_title": "Director of Design Strategy Involution Studios"}}
