{"Adrian_Westaway": {"website": "http://www.vitaminsdesign.com", "is_keynote": false, "class_name": "gender-m", "twitter": "adrianwestaway", "safe": "Adrian-Westaway", "prefix": "", "biography": ["Adrian is a founding member and director of Vitamins, a multidisciplinary design and invention studio.", "His work combines his background in electronics and training as a professional magician in the field of design. In 2007 he patented the Magic Light, a system to magically move spotlight beams using nothing but hand gestures. Adrian has an MEng in Electronic Engineering from Bristol University along with an MA in Industrial Design, from the Royal College of Art. He has worked with artists collective Greyworld and consulted for the BBC as well for consumer electronics brands including Samsung and Nokia."], "session_types": "presentation", "src": "adrianwestaway", "last": "Westaway", "country": "uk", "gender": "m", "organization": "Vitamins", "first": "Adrian", "job_title": "Director, Technology &amp; Magic"}, "Kel_Smith": {"website": "http://digital-outcasts.com/", "is_keynote": false, "class_name": "gender-m", "twitter": "kelsmith", "safe": "Kel-Smith", "prefix": "", "biography": ["Kel Smith is a longtime speaker, author and practitioner on digital accessibility. His articles and papers appear in the Pentagon Library, American Law Institute, American Bar Association, International Journal of E-Politics, Kent State&rsquo;s Knowledge Management Program, Sandra Day O&rsquo;Connor College of Law, E-Access Bulletin and UX Magazine. Kel&rsquo;s presentations include three appearances at the CSUN Conference for Persons with Disabilities (San Diego), two stints at World Future Society (Boston and Vancouver), the Royal National Institute of the Blind (London), the Interaction Design Association (Savannah), the Unitech ICT Network (Oslo), the Society for Technical Communications (Sacramento) and the Universitat Autònoma (Barcelona)."], "session_types": "presentation", "src": "kelsmith", "last": "Smith", "country": "us", "gender": "m", "organization": "Anikto LLC", "first": "Kel", "job_title": "Principal"}, "Jonathan_Kahn": {"website": "http://lucidplot.com", "is_keynote": false, "class_name": "gender-m", "twitter": "lucidplot", "safe": "Jonathan-Kahn", "prefix": "", "biography": ["Jonathan Kahn is a web developer, user experience designer, and content strategist. He&rsquo;s an advocate of user-centered design, web governance, and content strategy. He founded Together London in 2008. He&apos;s also organizing the Content Strategy Forum 2011 in London.", "Jonathan blogs at lucidplot.com, and he writes for the illustrious A List Apart magazine (&ldquo;Strategic Content Management&rdquo;, &ldquo;You Are Not a Robot&rdquo;). Recent speaking appearances include Content Strategy Forum 2010 in Paris, Confab 2011 in Minneapolis, and several London events including Ignite London, the UK UPA, and Lightning UX."], "session_types": "presentation", "src": "jonathankahn", "last": "Kahn", "country": "uk", "gender": "m", "organization": "Together London", "first": "Jonathan", "job_title": "Principal"}, "Sami_Niemelä": {"website": "http://nordkapp.fi", "is_keynote": false, "class_name": "gender-m", "twitter": "samin", "safe": "Sami-Niemelä", "prefix": "", "biography": ["Bio forthcoming"], "session_types": "presentation", "src": "saminiemelä", "last": "Niemelä", "country": "fi", "gender": "m", "organization": "Nordkapp", "first": "Sami", "job_title": "Creative Director"}, "Ariel_Waldman": {"website": "http://arielwaldman.com", "is_keynote": false, "class_name": "gender-f", "twitter": "arielwaldman", "safe": "Ariel-Waldman", "prefix": "", "biography": ["Ariel Waldman is an open science strategist, interaction designer and the founder of Spacehack.org, a directory of ways to participate in space exploration. She currently works at Institute For The Future. Recently, she founded Science Hack Day SF, an event that brings together scientists, technologists, designers and people with good ideas to see what they can create in a weekend.", "In 2008, she was named one of the top 50 most influential individuals in Silicon Valley. Previously, she was a CoLab Program Coordinator at NASA, a Digital Anthropologist at VML (a WPP agency), and a sci-fi movie columnist for Engadget."], "session_types": "presentation", "src": "arielwaldman", "last": "Waldman", "country": "us", "gender": "f", "organization": "Spacehack.org", "first": "Ariel", "job_title": "Open Science Strategist + Interaction Designer"}, "Fred_Beecher": {"website": "http://userexperience.evantageconsulting.com", "is_keynote": false, "class_name": "gender-m", "twitter": "fred_beecher", "safe": "Fred-Beecher", "prefix": "", "biography": ["Fred Beecher is a Lead User Experience Consultant &amp; Business Analyst with Evantage Consulting. He has been passionately engaged in the User Experience Design field for the past 13 years. A recognized expert in rapid prototyping and user experience design process, Fred speaks frequently on these topics at national and international conferences and local user experience group meetings. In 2007, Fred developed the official training program for the Axure RP Pro rapid prototyping tool at the request of its makers. He has since trained additional consultants to give the courses and currently leads a broader Axure training program for Evantage."], "session_types": "workshop sponsored-workshop", "src": "fredbeecher", "last": "Beecher", "country": "us", "gender": "m", "organization": "Evantage Consulting", "first": "Fred", "job_title": "Lead User Experience Consultant"}, "David_Cronin": {"website": "", "is_keynote": false, "class_name": "gender-m", "twitter": "davcron", "safe": "David-Cronin", "prefix": "", "biography": ["David Cronin is the Director of Interaction Design at GE, where he&rsquo;s working to bring a human focus to the next generation of digital experiences across GE&rsquo;s portfolio of products &amp; services from healthcare to transportation. Before GE, David spent 15 years at design firms, including as Director at Smart Design and Managing Director at Cooper. He has a deep background in healthcare user experience and couldn&rsquo;t be more excited about the topic of the Interaction12 GE Design Challenge."], "session_types": "sponsored-workshop", "src": "davidcronin", "last": "Cronin", "country": "us", "gender": "m", "organization": "GE", "first": "David", "job_title": "Director of Interaction Design"}, "Luke_Williams": {"website": "http://www.disruptive-thinking.com", "is_keynote": true, "class_name": "gender-m", "twitter": "lukegwilliams", "safe": "Luke-Williams", "prefix": "", "session_types": "keynote", "src": "lukewilliams", "last": "Williams", "country": "us", "gender": "m", "organization": "Frog Design", "first": "Luke", "job_title": "Author, Professor &amp; Fellow"}, "Scott_Nazarian": {"website": "http://www.frogdesign.com", "is_keynote": false, "class_name": "gender-m", "twitter": "dsnazarian", "safe": "Scott-Nazarian", "prefix": "", "biography": ["I am an interaction and media designer with a deep and abiding interest in science fiction and itsinfluence over popular expectations of the technologies surrounding humancomputer interaction. Subsequently, the deterministic aspects of both cultural perception as well as the technical and infrastructural innovations that ground technology&apos;s path to market are of great interest to me.", "Most recently to joining the frog team in mid-2007, I was a Principal UX Researcher at the Sun Labs in Menlo Park and received an MFA (Media Design) from the Art Center College of Design."], "session_types": "presentation", "src": "scottnazarian", "last": "Nazarian", "country": "us", "gender": "m", "organization": "frog", "first": "Scott", "job_title": "Creative Director"}, "Sebastian_Deterding": {"website": "http://codingconduct.cc", "is_keynote": false, "class_name": "gender-m", "twitter": "dingstweets", "safe": "Sebastian-Deterding", "prefix": "", "biography": ["Sebastian Deterding is a designer and researcher working on persuasive, gameful, and playful interactions.", "Before designing independently for startups, game companies and large brands, he was UX designer at magazine publisher Gruner+Jahr, and Program Manager Multimedia at the German Federal Agency for Civic Education.", "As a PhD researcher at Hamburg University, he looks into motivating behavior with game design elements, and currently organizes the Gamification Research Network. He publishes and speaks internationally at venues like CHI, Google, reboot, Web Directions, Playful, or The Gamification Summit, and has been covered by the Guardian, LA Times, New Scientist and others."], "session_types": "presentation", "src": "sebastiandeterding", "last": "Deterding", "country": "de", "gender": "m", "organization": "coding conduct", "first": "Sebastian", "job_title": "User Experience Designer"}, "Leanna_Gingras": {"website": "http://www.usabilityfail.com", "is_keynote": false, "class_name": "gender-f", "twitter": "leegoesplaces", "safe": "Leanna-Gingras", "prefix": "", "biography": ["Leanna wears many hats in the User Experience profession. Armed with a MSI from the UM School of Information, and a bachelor&rsquo;s in philosophy from Michigan State University, Lee enjoys wrestling with problems and designing solutions. When Lee&rsquo;s not bribing students with burritos, she enjoys marching up mountains and sleeping in tents."], "session_types": "presentation", "src": "leannagingras", "last": "Gingras", "country": "us", "gender": "f", "organization": "ITHAKA", "first": "Leanna", "job_title": "User Research Coordinator"}, "Jeff_Harrison": {"website": "http://userexperience.evantageconsulting.com", "is_keynote": false, "class_name": "gender-m", "twitter": "mrjeffharrison", "safe": "Jeff-Harrison", "prefix": "", "biography": ["Jeff Harrison is a senior user experience consultant with Evantage Consulting. He blends superb analytical ability, creative thinking, and experience solving real-world business problems to translate business requirements and user research into simple, efficient interactions. Most design problems don&rsquo;t have a perfect solution, but Jeff can usually come up with a number of good options, explain the pros and cons of each, and suggest a way of testing them to arrive at the best. Jeff has become recognized within the user experience community for his expertise with the Axure RP Pro prototyping tool, and his willingness to solve thorny problems."], "session_types": "workshop", "src": "jeffharrison", "last": "Harrison", "country": "us", "gender": "m", "organization": "Evantage Consulting", "first": "Jeff", "job_title": "Senior User Experience Consultant"}, "John_Finley": {"website": "http://www.heyfinley.com/", "is_keynote": false, "class_name": "gender-m", "twitter": "jpfinley", "safe": "John-Finley", "prefix": "", "biography": ["John Finley thinks about the different ways in which interaction design manifests itself in our world.", "In 2011, he graduated as part of the inaugural class of the MFA in Interaction Design program at the School of Visual Arts in New York City. At one point in his life he was a college radio DJ, but now he is a freelance developer and designer of web software."], "session_types": "presentation", "src": "johnfinley", "last": "Finley", "country": "us", "gender": "m", "organization": false, "first": "John", "job_title": "Interaction Designer"}, "Joan_Vermette": {"website": "http://madpow.net", "is_keynote": false, "class_name": "gender-f", "twitter": "jayeffvee", "safe": "Joan-Vermette", "prefix": "", "biography": ["Joan Vermette has 14 years as a UX designer/manager, nearly all of it as a charter member of the design group at Fidelity Investments for which she created and promoted design process, standards, and their component library. For nearly two years, Joan has been a user experience design consultant at Mad*Pow. She&rsquo;s interested in design process and how to sustain organizational learning about design over time. She doesn&apos;t think documentation necessarily has to die on the shelf.", "Joan has a BA in Cultural Theory from Brandeis University."], "session_types": "presentation", "src": "joanvermette", "last": "Vermette", "country": "us", "gender": "f", "organization": "Mad*Pow", "first": "Joan", "job_title": "Experience Design Consultant"}, "Akshay_Kapur": {"website": "http://medicalavatar.com", "is_keynote": false, "class_name": "gender-m", "twitter": "medicalavatar", "safe": "Akshay-Kapur", "prefix": "", "biography": ["As the EHR implementation expert for Weill Cornell Medical College and UBMD, a 500-physician practice group, Akshay Kapur transitioned 17 individual medical practices from paper to electronic systems in the last 6 years. He increased efficiency in all aspects of the medical practice using the EHR, enhanced physician interaction with patients in and out of the office, and improved quality of care through data trending and medical error alerts. Akshay&rsquo;s implementation and managerial expertise led to revenue increases upwards of $2-$4 million per practice, reduced physician documentation time by 32%, and improved patient satisfaction ratings from 70% to over 90%."], "session_types": "presentation", "src": "akshaykapur", "last": "Kapur", "country": "us", "gender": "m", "organization": "Medical Avatar", "first": "Akshay", "job_title": "Co-Founder"}, "Dirk_Knemeyer": {"website": "http://dirk.knemeyer.com", "is_keynote": false, "class_name": "gender-m", "twitter": "dknemeyer", "safe": "Dirk-Knemeyer", "prefix": "", "biography": ["Dirk Knemeyer is a design entrepreneur overseeing three companies: Sprout, Inc., a consumer software start-up that helps people better understand themselves and their friends; Involution Studios, a software design consultancy with clients including Apple, Oracle and President Barack Obama; and Conquistador Games, a game design and production studio.", "Over the last decade Dirk has published over 100 articles on design and business, spoken at more than 50 conferences &#8211; including keynotes in the U.S. and Europe &#8211; and has served on 13 different Board for corporations and design-based non-profit organizations."], "session_types": "presentation", "src": "dirkknemeyer", "last": "Knemeyer", "country": "us", "gender": "m", "organization": "Involution Studios & Sprout, Inc.", "first": "Dirk", "job_title": "Big Thinker, Relentless Doer, Founder"}, "Christopher_Avore": {"website": "http://erova.com", "is_keynote": false, "class_name": "gender-m", "twitter": "erova", "safe": "Christopher-Avore", "prefix": "", "biography": ["Chris Avore is a product strategist and designer in New York City. After organizing the first UX Show and Tell workshop in Washington DC in 2009, Chris has since led or helped organize workshops across the globe, including Interaction 10 and 11, the IA Summit, and UX Russia."], "session_types": "presentation", "src": "christopheravore", "last": "Avore", "country": "us", "gender": "m", "organization": "NASDAQ OMX", "first": "Christopher", "job_title": "Product Strategist &amp; Designer"}, "Katey_Deeny": {"website": "http://followsprocess.wordpress.com", "is_keynote": false, "class_name": "gender-f", "twitter": "followsprocess", "safe": "Katey-Deeny", "prefix": "", "biography": ["Katey has over 12 years of experience designing effective, delightful solutions to complex user challenges.", "Katey has researched, evaluated, and designed mobile, software, and web interactions for companies including Microsoft, Boeing, Amazon, and T-mobile. She has taught a variety of experience design courses at Savannah College of Art and Design and the University of Washington.", "Katey&rsquo;s professional knowledge is complemented by advanced academic work. She earned her Master of Fine Arts degree from Savannah College of Art and Design and her Master of Science degree from the University of Washington."], "session_types": "presentation", "src": "kateydeeny", "last": "Deeny", "country": "us", "gender": "f", "organization": "WebMD Health Services", "first": "Katey", "job_title": "Director of User Experience Design"}, "Thomas_Kueber": {"website": "http://www.iconmobile.com", "is_keynote": false, "class_name": "gender-m", "twitter": "", "safe": "Thomas-Kueber", "prefix": "", "biography": ["Thomas is obsessed with humanizing technology ever since he got his hands on his first computer. After working his way through HCI research and design consulting for business applications he joint iconmobile in 2009. During daylight he focuses on helping fortune 500 organizations to embed successful mobile strategies and bring valuable service propositions to the mobile market. When the office lights go out he is leading Berlin&lsquo;s interaction design community IxDA Berlin and co-organizes the UXcamp Europe, a free user experience conference that attracts over 400 people every year."], "session_types": "presentation", "src": "thomaskueber", "last": "Kueber", "country": "de", "gender": "m", "organization": "iconmobile", "first": "Thomas", "job_title": "Design Lead"}, "Virgil_Wong": {"website": "http://medicalavatar.com", "is_keynote": false, "class_name": "gender-m", "twitter": "medicalavatar", "safe": "Virgil-Wong", "prefix": "", "session_types": "presentation", "src": "virgilwong", "last": "Wong", "country": "us", "gender": "m", "organization": "Medical Avatar", "first": "Virgil", "job_title": "Co-Founder"}, "Angela_Schmeidel Randall": {"website": "http://www.normalmodes.com", "is_keynote": false, "class_name": "gender-f", "twitter": "normalmodes", "safe": "Angela-Schmeidel-Randall", "prefix": "", "biography": ["Angela Schmeidel Randall is the Chief eXperience Officer of the Houston-based UX design and usability firm Normal Modes. Prior to founding Normal Modes, she redesigned and upgraded end-to-end experiences on a variety of customer-facing systems for Continental Airlines, which remain widely used today. Angela has conducted way more than 10,000 hours of UX projects in her career, including many for Normal Modes&rsquo; Fortune 500 clients. She holds a bachelor&rsquo;s degree from the University of St. Thomas and a master&rsquo;s degree from Rice University."], "session_types": "presentation", "src": "angelaschmeidelrandall", "last": "Schmeidel Randall", "country": "us", "gender": "f", "organization": "Normal Modes", "first": "Angela", "job_title": "Chief EXperience Officer"}, "Andrea_Resmini": {"website": "http://andrearesmini.com", "is_keynote": false, "class_name": "gender-m", "twitter": "resmini", "safe": "Andrea-Resmini", "prefix": "Dr. ", "biography": ["Researcher, president of the Information Architecture Institute, FatDUX associate, co-author of \"Pervasive Information Architecture\" for Morgan Kauffman.", "Teaching interaction design, game design and information architecture and the University of Borås and Gothenburg, and at Jönköping International Business School."], "session_types": "presentation", "src": "andrearesmini", "last": "Resmini", "country": "se", "gender": "m", "organization": "University of Borås", "first": "Andrea", "job_title": "Information Architect"}, "Christina_Persson": {"website": "http://www.madpow.net", "is_keynote": false, "class_name": "gender-f", "twitter": "christina_xd", "safe": "Christina-Persson", "prefix": "", "biography": ["Christina Persson has researched, designed, and user-tested hardware, software, mobile, and web in a variety of development process including waterfall, staged, and Agile. She is an experience design director at Mad*Pow. She loves creating user experiences that makes peoples&rsquo; lives a heck of a lot more enjoyable, and partnering with clients to meet their business objectives. Christina holds double BFAs from Carnegie Mellon University in Industrial Design and Human-Computer Interaction."], "session_types": "presentation", "src": "christinapersson", "last": "Persson", "country": "us", "gender": "f", "organization": "Mad*Pow", "first": "Christina", "job_title": "Experience Design Director"}, "Elizabeth_Buie": {"website": "http://www.luminanze.com", "is_keynote": false, "class_name": "gender-f", "twitter": "ebuie", "safe": "Elizabeth-Buie", "prefix": "", "biography": ["Elizabeth has 30 years in human-computer interaction and UX of various types of products, from web sites, web applications, and desktop applications to highly complex systems such as spacecraft control centers. She spent several years in system engineering, defining/analyzing system requirements and integrating the HCI process into the system life cycle. Elizabeth has master&apos;s degrees in mathematics and in human development. She served on the editorial board of ACM&apos;s &ldquo;interactions&rdquo; magazine for six years, and currently serves on the editorial board of UPA&apos;s online \"Journal of Usability Studies\". She is co-chair of case studies for the CHI2012 conference."], "session_types": "presentation", "src": "elizabethbuie", "last": "Buie", "country": "us", "gender": "f", "organization": "Luminanze Consulting", "first": "Elizabeth", "job_title": "Principal Consultant"}, "Shane_Morris": {"website": "http://www.linkedin.com/in/shanemo", "is_keynote": false, "class_name": "gender-m", "twitter": "shanemo", "safe": "Shane-Morris", "prefix": "", "biography": ["Shane Morris is one of Australia&rsquo;s most respected user experience professionals. Through consulting, mentoring and training he has helped organisations create compelling digital experiences since 1991. He has worked on desktop applications, internet applications, mobile user interfaces, physical devices and web sites. Shane has taught user experience topics around the world and is a key contributor to &ldquo;101 Things I Learned in Interaction Design School&rdquo; at ixd101.com. Shane has worked with companies like Tennis Australia, Microsoft, Lonely Planet, M&amp;C Saatchi, Cochlear, Amnesia Razorfish and Qantas &#8211; helping creative and technical professionals collaborate to create services that empower, inspire and reward."], "session_types": "presentation", "src": "shanemorris", "last": "Morris", "country": "au", "gender": "m", "organization": "Automatic Studio", "first": "Shane", "job_title": "User Experience Architect"}, "Fabian_Hemmert": {"website": "http://www.fabianhemmert.com", "is_keynote": true, "class_name": "gender-m", "twitter": "", "safe": "Fabian-Hemmert", "prefix": "", "session_types": "keynote", "src": "fabianhemmert", "last": "Hemmert", "country": "de", "gender": "m", "organization": false, "first": "Fabian", "job_title": "Design Researcher"}, "Ingi_Helgason": {"website": "http://complexpleasures.wordpress.com/about-me/", "is_keynote": false, "class_name": "gender-f", "twitter": "urbanixd", "safe": "Ingi-Helgason", "prefix": "", "biography": ["Ingi Helgason is studying towards a PhD in Interaction Design at Edinburgh Napier University, where she also works as a lecturer in interactive media design, and a researcher in the field of pervasive computing.", "With a background in graphic and visual communication, her research interests focus on investigating interactions with new-media art installations, and technology-mediated social interactions in public and urban spaces. Her current teaching covers contextual design, and technology design and innovation. An active member of the executive committee of the Create series of IxD conferences, Ingi has recently joined the program committee of the BCS HCI conference for 2012. She is one of the organisers of This Happened Edinburgh, a series of events focusing on the stories behind interaction design."], "session_types": "presentation", "src": "ingihelgason", "last": "Helgason", "country": "uk", "gender": "f", "organization": "Centre for Interaction Design, Edinburgh Napier University", "first": "Ingi", "job_title": "Researcher"}, "Katie_Koch": {"website": "http://www.pixelkated.com", "is_keynote": false, "class_name": "gender-f", "twitter": "pixelkated", "safe": "Katie-Koch", "prefix": "", "biography": ["Katie co-founded Project: Interaction, an after school program that teaches high school students how to change their communities using design. She&apos;s a recent graduate from the MFA in Interaction Design program at the School of Visual Arts in New York City. Outside of her work creating a framework for high school design curriculum, Katie is a user experience designer whose work focuses on the ways people build relationships and interact with each other when mediated by technology and community engagement. She holds a BFA in Visual Communications from Washington University in St. Louis and lives and works in Brooklyn, NY."], "session_types": "presentation", "src": "katiekoch", "last": "Koch", "country": "us", "gender": "f", "organization": "Project: Interaction", "first": "Katie", "job_title": "Co-Founder, Designer &amp; Teacher"}, "Anthony_Dunne": {"website": "http://www.dunneandraby.co.uk/content/projects", "is_keynote": true, "class_name": "gender-m", "twitter": "DI__RCA", "safe": "Anthony-Dunne", "prefix": "", "biography": ["Anthony Dunne is professor and head of the Design Interactions programme at the Royal College of Art in London. He is also a partner in the design practice Dunne &amp; Raby. He studied Industrial Design at the RCA before working at Sony Design in Tokyo. On returning to London he completed a PhD in Computer Related Design at the RCA. He was a founding member of the CRD Research Studio where he worked as a Senior Research Fellow leading industry and EU funded research projects.", "His work with Fiona Raby uses products and services as a medium to stimulate discussion and debate amongst designers, industry and the public about the social, cultural and ethical implications of emerging technologies.", "Projects include Hertzian Tales, a combination of essays and design proposals exploring aesthetic and critical possibilities for electronic products (MIT Press 2005); Placebo, a collection of electronic objects exploring mental well-being in relation to domestic electromagnetic fields; Technological Dreams Series, no.1: Robots for Z33; and Foragers for the St Etienne International Design Biennale. Design Noir: The Secret Life of Electronic Objects was published by Birkhauser in 2001. His work with Fiona Raby has been exhibited and published internationally and is in private and permanent collections including MoMA, the Victoria &amp; Albert Museum and Frac Ile-de-France.", "Anthony was awarded the Sir Misha Black Award for Innovation in Design Education in 2009."], "session_types": "keynote", "src": "anthonydunne", "last": "Dunne", "country": "ie", "gender": "m", "organization": "Royal College of Art in London", "first": "Anthony", "job_title": "Professor &amp; Head of the Design Interactions Programme"}, "Abi_Jones": {"website": "http://www.jonesabi.com", "is_keynote": false, "class_name": "gender-f", "twitter": "jonesabi", "safe": "Abi-Jones", "prefix": "", "biography": ["Abi is an interaction designer on the search team at Google, focusing on the social aspects of search. Prior to joining Google in 2011, Abi designed social systems for MySpace and Loomis Group, as well as online safety and leadership training for the Mine Safety and Health Administration, and portfolio and self-assessment tools at the American Board for Certification of Teacher Excellence.", "Abi is the vice-chair of the Bay Area ACM-SIG on Computer Human Interaction, and earned a bachelor&apos;s degree in Art History from Seattle University and a masters degree in Instructional Design and Development from George Mason University."], "session_types": "presentation", "src": "abijones", "last": "Jones", "country": "us", "gender": "f", "organization": "Google", "first": "Abi", "job_title": "Interaction Designer"}, "Abby_Covert": {"website": "http://Abbytheia.com", "is_keynote": false, "class_name": "gender-f", "twitter": "Abby_The_IA", "safe": "Abby-Covert", "prefix": "", "biography": ["Whether working on consumer packaged goods or healthcare, Abby aims to make the unclear, clear. She believes firmly that while no one likes to be advertised to, everyone loves a quality brand experience.", "Abby has created a diverse portfolio of user-centric strategies and deliverables for a wide range of brands focused in healthcare, C.P.G, retail, beer, fast food and automotive. She is a blogger on the integration of user-centric practices within creative organizations. For her efforts in the advertising world she was recently listed by Direct Marketing News as one of the top 30 marketers under 30."], "session_types": "presentation", "src": "abbycovert", "last": "Covert", "country": "us", "gender": "f", "organization": "The Understanding Group", "first": "Abby", "job_title": "Information Architect"}, "Bill_Caemmerer": {"website": "http://www.caemmerer.net", "is_keynote": false, "class_name": "gender-m", "twitter": "billbc", "safe": "Bill-Caemmerer", "prefix": "", "biography": ["I&apos;ve worked for top interactive companies in financial services, e-commerce, advertising, healthcare, and media, but I began with an interest in designing software for learning music and language. I look to understand the underlying issues and goals of a project to develop a point of view, and then design straightforward, practical, and innovative solutions. Information displays should reveal and illuminate, and software should be responsive and empowering. Currently I&apos;m a freelance IxD in New York, as well as musician and occasional linguist."], "session_types": "presentation", "src": "billcaemmerer", "last": "Caemmerer", "country": "us", "gender": "m", "organization": "Independent", "first": "Bill", "job_title": "Interaction Designer"}, "Michael_Smyth": {"website": "http://www.michael-smyth.co.uk", "is_keynote": false, "class_name": "gender-m", "twitter": "michael_smyth", "safe": "Michael-Smyth", "prefix": "Dr. ", "biography": ["Michael Smyth is a Reader in the Centre for Interaction Design, Edinburgh Napier University, UK. He has worked in the fields of Human Computer Interaction and Interaction Design since 1987 and during that period has published over 50 academic papers in refereed journals, books and conferences. In addition he has had interactive installations exhibited at both UK and international conferences and arts &amp; design festivals. He is co-editor of the book entitled Digital Blur: creative practice at the boundaries of architecture, design and art, Libri Publishing."], "session_types": "presentation", "src": "michaelsmyth", "last": "Smyth", "country": "uk", "gender": "m", "organization": "Centre for Interaction Design, Edinburgh Napier University", "first": "Michael", "job_title": "Reader"}, "Dan_Saffer": {"website": "http://odannyboy.com", "is_keynote": false, "class_name": "gender-m", "twitter": "odannyboy", "safe": "Dan-Saffer", "prefix": "", "biography": ["Interaction Designer and Author of Designing for Interaction and Designing Gestural Interfaces."], "session_types": "workshop presentation", "src": "dansaffer", "last": "Saffer", "country": "us", "gender": "m", "organization": "Syntactic Devices", "first": "Dan", "job_title": "Founder"}, "Giles_Colborne": {"website": "http://cxpartners.co.uk", "is_keynote": false, "class_name": "gender-m", "twitter": "gilescolborne", "safe": "Giles-Colborne", "prefix": "", "biography": ["Giles is author of 'Simple and usable web mobile and interaction design' published by New Riders. He has been working in usability and user centred design since 1991. He formed cxpartners with Richard Caddick in 2004 and works with companies all over the world to create web and mobile user experiences that make a measurable difference to their bottom line and their customers' lives.", "Giles is a former President of the UK Usability Professionals&rsquo; Association and has worked with British Standards Institute in developing guidance on web accessibility."], "session_types": "presentation", "src": "gilescolborne", "last": "Colborne", "country": "uk", "gender": "m", "organization": "cxpartners", "first": "Giles", "job_title": "Managing Director"}, "Dave_Malouf": {"website": "http://davemalouf.com/", "is_keynote": false, "class_name": "gender-m", "twitter": "daveixd", "safe": "Dave-Malouf", "prefix": "", "biography": ["Dave Malouf is currently the Professor of Interaction Design in the Industrial Design department of the Savannah College of Art &amp; Design (SCAD). Dave has been doing IxD for close to 20yrs with most experience in enterprise software &amp; hardware systems. His work as a professor centers on exploring the boundaries of design education in the contemporary age of transdisciplinary design centering on issues of criticism, collaboration and rich theories."], "session_types": "workshop presentation", "src": "davemalouf", "last": "Malouf", "country": "us", "gender": "m", "organization": "Savannah College of Art & Design", "first": "Dave", "job_title": "Professor"}, "Jeff_Gothelf": {"website": "http://www.jeffgothelf.com/blog", "is_keynote": false, "class_name": "gender-m", "twitter": "jboogie", "safe": "Jeff-Gothelf", "prefix": "", "biography": ["Jeff Gothelf has spent a 14 year career as an interaction designer, Agile practitioner, user experience team leader and blogger. He is one of the leading voices on the topic of Agile UX and Lean UX. In addition, Jeff is the author of the upcoming O'Reilly book (2012), Lean UX: Getting Out of the Deliverables Business. He is a highly sought-after international speaker having presented at EuroIA, SXSW, IA Summit, the Agile conference and Startup Lessons Learned. Jeff has led cross-functional product design teams at TheLadders, Publicis Modem, WebTrends, Fidelity, and AOL while maintaining a strong advisory and mentorship presence in the startup communities of New York City and Silicon Valley. He has recently launched Proof, a product design and innovation studio that combines lean processes with strategy, design and technology."], "session_types": "presentation", "src": "jeffgothelf", "last": "Gothelf", "country": "us", "gender": "m", "organization": "Proof", "first": "Jeff", "job_title": "Principal"}, "Michael_Lemmon": {"website": "http://michaellemmon.com", "is_keynote": false, "class_name": "gender-m", "twitter": "mikelemmon", "safe": "Michael-Lemmon", "prefix": "", "biography": ["Mike is passionate about helping brands meet the needs of people through meaningful digital products and services. He has worked across industries in entertainment, technology, health and communications for companies such as Intel, Wacom, SiriusXM, Research in Motion, TDK, Proctor &amp; Gamble, and Microsoft. A native Northwesterner, he lives in Portland, Oregon."], "session_types": "presentation", "src": "michaellemmon", "last": "Lemmon", "country": "us", "gender": "m", "organization": "Ziba Design", "first": "Michael", "job_title": "Creative Director"}, "Michal_Levin": {"website": "", "is_keynote": false, "links": false, "class_name": "gender-f", "twitter": "", "safe": "Michal-Levin", "prefix": "", "biography": ["Michal Levin, User Experience Designer at Google, has extensive experience in UX design for web, mobile and TV, with comprehensive knowledge in User-Centered Design, consumers behavior, interaction design, information architecture and persuasive marketing.", "In her current role, Michal is responsible for the UX design of global products in the areas of Analytics, Search, Data visualization and more. She previously worked as Senior UX Architect at TZUR &#8211; a leading UX consultancy company in Israel, and as UX Specialist at modu.", "She published professional articles in leading newspapers and websites, as well as lectured about UX in Israel and abroad."], "session_types": "presentation", "src": "michallevin", "last": "Levin", "country": "is", "gender": "f", "organization": "Google (Israel)", "first": "Michal", "job_title": "User Experience Designer"}, "Chui Chui_Tan": {"website": "http://www.cxpartners.co.uk/about/people/chui_chui_tan", "is_keynote": false, "class_name": "gender-f", "twitter": "ChuiSquared", "safe": "Chui-Chui-Tan", "prefix": "", "biography": ["Chui Chui Tan is a Senior User Experience Consultant at cxpartners and has been working in usability and user centred design since 2002. She has extensive experience of running international user research across Europe and Asia. Chui Chui has a background and many years of professional experience in design, engineering (Mechanical Industrial Engineering) and Human Computer Interaction. Chui Chui has previously worked at Panasonic where she was involved in the whole design and manufacturing process &#8211; from costing to design to prototyping to production. Chui Chui has spoken and provided workshops at various conferences in Europe, the USA and Asia."], "session_types": "presentation", "src": "chuichuitan", "last": "Tan", "country": "uk", "gender": "f", "organization": "cxpartners", "first": "Chui Chui", "job_title": "Senior User Experience Consultant"}, "Jason_Mesut": {"website": "http://www.rma-consulting.com", "is_keynote": false, "class_name": "gender-m", "twitter": "jasonmesut", "safe": "Jason-Mesut", "prefix": "", "biography": ["Jason is Head of User Experience at RMA Consulting, a design-driven organisation that focuses on delivering rich, engaging and effective solutions for users to interact with 'Day-In, Day-Out'.", "Over the past 12 years, Jason has had experience working with a range of organisations including: PA Consulting, Yell.com, Flow Interactive, Oyster/Framfab/LBi and The Team. This has seen him working among some of the best people in the UK User Experience industry, and with some of the trickiest of clients and team members imaginable.", "Jason isn&apos;t shy of his opinions and likes to stir up critical discourse in User Experience and design."], "session_types": "workshop", "src": "jasonmesut", "last": "Mesut", "country": "uk", "gender": "m", "organization": "RMA Consulting", "first": "Jason", "job_title": "Head of User Experience"}, "Eva-Lotta_Lamm": {"website": "http://www.evalotta.net", "is_keynote": false, "class_name": "gender-f", "twitter": "evalottchen", "safe": "Eva-Lotta-Lamm", "prefix": "", "biography": ["Eva-Lotta is a freelance UX Designer. She previously headed the business design team at Skype, worked as interaction designer for Yahoo! in London and as lead designer for Kahn + Associates in Paris.", "Besides her daytime mission of making the web a more understandable, usable and delightful place, she regularly takes sketchnotes at all sorts of talks and conferences and recently turned these into a little book.", "She also teaches sketching and runs UX Sketch Club, a monthly(-ish) meetup for people who are interested in experimenting with sketching and sharing their work."], "session_types": "workshop", "src": "evalottalamm", "last": "Lamm", "country": "uk", "gender": "f", "organization": "Independent", "first": "Eva-Lotta", "job_title": "UX Designer"}, "Jason_Brush": {"website": "http://www.possibleworldwide.com", "is_keynote": false, "class_name": "gender-m", "twitter": "jasonbrush", "safe": "Jason-Brush", "prefix": "", "biography": ["Jason Brush teaches at UCLA and Art Center College of Design, and is EVP of User Experience Design at Possible Worldwide, an Emmy and IDEA award-winning marketing and design firm. His recent work includes leading the interaction design of Google&apos;s Cannes Lions Gold–winning Google Art Project, Sony&rsquo;s Xperia X10, interactive installations for the BIll &amp; Melinda Gates Foundation, and interfaces for BMW, Comcast and Disney. He holds an MFA in Film Directing from UCLA."], "session_types": "presentation", "src": "jasonbrush", "last": "Brush", "country": "us", "gender": "m", "organization": "Possible Worldwide", "first": "Jason", "job_title": "EVP, User Experience Design"}, "Pete_Denman": {"website": "http://www.intel.com", "is_keynote": false, "class_name": "gender-m", "twitter": "", "safe": "Pete-Denman", "prefix": "", "biography": ["I am a &ldquo;designer.&rdquo; I have a degree in Graphic Design and worked as a visual designer for about 10 years and moved slowly into User Interface and User experience design. Currently I do rapid prototyping for Intel Labs. I am a senior user Experience designer developing products. I am involved with all early aspects of the process from evaluating user needs, through technical development, user interface, visual design and finally user testing. In the past I have followed the product into development. Right now I deliver the PRD and move to the next exciting adventure."], "session_types": "presentation", "src": "petedenman", "last": "Denman", "country": "us", "gender": "m", "organization": "Intel", "first": "Pete", "job_title": "User Experience Designer"}, "Stephen_Anderson": {"website": "http://www.poetpainter.com", "is_keynote": false, "class_name": "gender-m", "twitter": "stephenanderson", "safe": "Stephen-Anderson", "prefix": "", "biography": ["Stephen P. Anderson is an internationally recognized speaker and consultant based out of Dallas, Texas. He created the Mental Notes card deck, a tool that&apos;s widely used by product teams to apply psychology to interaction design. He&rsquo;s also of the author of the book &ldquo;Seductive Interaction Design,&rdquo; which explores this topic of psychology and design in more detail.", "Between public speaking and project work, Stephen offers workshops and training to help organizations manage creative teams, make use of visual thinking, and design better customer experiences."], "session_types": "workshop", "src": "stephenanderson", "last": "Anderson", "country": "us", "gender": "m", "organization": "PoetPainter", "first": "Stephen", "job_title": "Independent Consultant"}, "MJ_Broadbent": {"website": "http://www.mjbroadbent.com", "is_keynote": false, "class_name": "gender-f", "twitter": "mjbroadbent", "safe": "MJ-Broadbent", "prefix": "", "biography": ["MJ is an independent design consultant whose work over the past two decades spans a diverse range of visual and interactive design applications. Her practical expertise and leadership in the UX realm has benefited organizations such as the Bill and Melinda Gates Foundation, Bookspan (now DirectGroup Bertelsmann), College Board, Empire BlueCrossBlueShield, H&amp;R Block, The McGraw-Hill Companies (including Standard &amp; Poor&apos;s), Pfizer, Sony Electronics, Thomas Publishing, and the United Nations.", "MJ teaches workshops on drawing skills and is a curator for VizThink, the global community of visual thinking."], "session_types": "workshop", "src": "mjbroadbent", "last": "Broadbent", "country": "us", "gender": "f", "organization": "MJ Broadbent Design", "first": "MJ", "job_title": "Principal Consultant"}, "Angel_Anderson": {"website": "http://www.cpbgroup.com", "is_keynote": false, "class_name": "gender-f", "twitter": "angel", "safe": "Angel-Anderson", "prefix": "", "biography": ["Angel Anderson has 10+ years of experience humanizing digital products and services for clients such as Old Navy, Microsoft, Fox, Pepsi, and Mattel. Much of her work has flourished as part of the social web and has helped her formulate clear guidelines for creating rich social frameworks. Angel is active in the Los Angeles design community as the founding IxDA Los Angeles local leader and as a guest lecturer at USC, UCLA, and The Arts Institute of California."], "session_types": "presentation", "src": "angelanderson", "last": "Anderson", "country": "us", "gender": "f", "organization": "Crispin Porter + Bogusky", "first": "Angel", "job_title": "Experience Director"}, "Christian_Drehkopf": {"website": "http://www.iconmobile.com", "is_keynote": false, "class_name": "gender-m", "twitter": "", "safe": "Christian-Drehkopf", "prefix": "", "biography": ["Christian is a design expert with in-depth expertise in planning, executing and using qualitative research to shape strategies that focus on mobile innovation. He combines an outstanding analytical ability to gain comprehensive understanding of people´s needs with the sensibility and empathy of a designer to form meaningful, holistic user experiences. In 2008 Christian joined iconmobile where he is responsible for launching and accelerating international user-centered research programs for well known companies, such as Nokia, Samsung and BMW. "], "session_types": "presentation", "src": "christiandrehkopf", "last": "Drehkopf", "country": "de", "gender": "m", "organization": "iconmobile", "first": "Christian", "job_title": "Design Lead"}, "Andrew_Hinton": {"website": "http://www.andrewhinton.com", "is_keynote": false, "class_name": "gender-m", "twitter": "inkblurt", "safe": "Andrew-Hinton", "prefix": "", "biography": ["Andrew Hinton is Principal User Experience Architect at Macquarium, a user-experience consulting firm based in Atlanta, GA. Andrew has designed information systems and interfaces for Fortune 100s, small businesses and non-profits alike, as both an internal employee and an external consultant. Andrew has served as a co-founder and past board member of the IA Institute, and is a long-time member &amp; supporter of IxDA."], "session_types": "presentation", "src": "andrewhinton", "last": "Hinton", "country": "us", "gender": "m", "organization": "Macquarium", "first": "Andrew", "job_title": "Principal UX Architect"}, "Maggie_Breslin": {"website": "", "is_keynote": false, "links": false, "class_name": "gender-f", "twitter": "", "safe": "Maggie-Breslin", "prefix": "", "biography": ["Maggie Breslin serves as a senior designer/researcher in the Center for Innovation at Mayo Clinic, a role she pioneered when she joined in 2005. She leads research, design and development efforts around topics as diverse as patient decision-making, risk communication, integrated practice models, remote care and caregiving. She has published in journals ranging from Design Issues to Archives of Internal Medicine and had a previous life in film/television/animation/motion graphics. Maggie holds a Masters of Design (MDes) from Carnegie Mellon University and a BS in Mass Communications, Film and Television, from Miami University, Oxford, Ohio."], "session_types": "presentation", "src": "maggiebreslin", "last": "Breslin", "country": "us", "gender": "f", "organization": "Mayo Clinic", "first": "Maggie", "job_title": "Designer/Researcher"}, "Jeroen_van Geel": {"website": "http://www.fabrique.nl", "is_keynote": false, "class_name": "gender-m", "twitter": "jeroenvangeel", "safe": "Jeroen-van-Geel", "prefix": "", "biography": ["Jeroen van Geel is the founder and chief kahuna of Johnny Holland. During the day he works as a senior interaction designer at Fabrique [brands, design &amp; interaction]. He has over 8 years of experience in the field and works for clients in many different branches, ranging from retail to cultural heritage, education and travel."], "session_types": "presentation", "src": "jeroenvangeel", "last": "van Geel", "country": "nl", "gender": "m", "organization": "Fabrique [brands, design & interaction]", "first": "Jeroen", "job_title": "Interaction Director"}, "Erik_Dahl": {"website": "http://www.goinvo.com", "is_keynote": false, "class_name": "gender-m", "twitter": "eadahl", "safe": "Erik-Dahl", "prefix": "", "biography": ["I am a designer, anthropologist and bricoleur. I work as Director of Design Strategy at Involution Studios, founded MidwestUX Conference, help lead the local Columbus IxDA, and enjoy taking pictures of people in their side view mirrors."], "session_types": "presentation", "src": "erikdahl", "last": "Dahl", "country": "us", "gender": "m", "organization": "Involution Studios", "first": "Erik", "job_title": "Director of Design Strategy Involution Studios"}, "Frederick_van Amstel": {"website": "http://fredvanamstel.com", "is_keynote": false, "class_name": "gender-m", "twitter": "fredvanamstel", "safe": "Frederick-van-Amstel", "prefix": "", "biography": ["Frederick van Amstel is cofounder of the first Brazilian Interaction Design Institute. At Faber-Ludens, he conducted research on designing for social interactions, co-creation and collaborative design. He lead consultancy teams for clients like Electrolux, O Globo, Coca-Cola. Frederick is currently doing a PhD on Participatory Design at the University of Twente, Netherlands."], "session_types": "presentation", "src": "frederickvanamstel", "last": "van Amstel", "country": "br", "gender": "m", "organization": "Faber-Ludens Interaction Design Institute", "first": "Frederick", "job_title": "Researcher"}, "Andrew_Crow": {"website": "", "is_keynote": false, "class_name": "gender-m", "twitter": "andrewcrow", "safe": "Andrew-Crow", "prefix": "", "biography": ["Andrew Crow designs products and services that delight people and exceed business expectation. Nearly 20 years of experience in visual, interaction and product design have given him a deep perspective on creating meaningful experiences for consumers.", "Andrew is the Director of Visual Design at GE where he is a part of the UX Center of Excellence. He is focused on visual and interaction design for projects involving robots and jet engines. His past lives were spent as Vice President of Experience Design at Razorfish and a Lead Experience Designer at Adaptive Path."], "session_types": "sponsored-workshop", "src": "andrewcrow", "last": "Crow", "country": "us", "gender": "m", "organization": "GE", "first": "Andrew", "job_title": "Director of Visual Design"}, "Dana_Chisnell": {"website": "http://www.usabiltiyworks.net", "is_keynote": false, "class_name": "gender-f", "twitter": "danachis", "safe": "Dana-Chisnell", "prefix": "", "biography": ["Dana is an independent researcher currently working on usable security and research methods for social media usability. Dana has helped thousands of people learn how to make better design decisions by giving them skills to gain knowledge about the people using the designs. She has observed hundreds of study participants to learn about design issues in software, hardware, web sites, online services, games, and ballots, and helped organizations perform usability tests and user research to inform design decisions for products and services. She&apos;s the co-author, with Jeff Rubin, of Handbook of Usability Testing Second Edition (Wiley, 2008)"], "session_types": "presentation", "src": "danachisnell", "last": "Chisnell", "country": "us", "gender": "f", "organization": "UsabilityWorks", "first": "Dana", "job_title": "Researcher"}, "Genevieve_Bell": {"website": "", "is_keynote": true, "links": false, "class_name": "gender-f", "twitter": "", "safe": "Genevieve-Bell", "prefix": "Dr. ", "biography": ["Dr. Genevieve Bell is an Australian-born anthropologist and researcher. As director of User Interaction and Experience in Intel Labs, Dr. Bell leads a research team of social scientists, interaction designers, human factors engineers and computer scientists. This team shapes and helps create new Intel technologies and products that are increasingly designed around people&rsquo;s needs and desires. In this team and her prior roles, Dr. Bell has fundamentally altered the way Intel envisions and plans its future products so that they are centered around people&rsquo;s needs rather than simply silicon capabilities.", "Dr. Bell is also an accomplished industry pundit on the intersection of culture and technology and a regular public speaker and panelist at technology conferences worldwide. Her first book, Divining the Digital Future: Mess and Mythology in Ubiquitous Computing, was co-written with Professor Paul Dourish of University of California at Irvine and released in April 2011. In 2010, Bell was named one of Fast Company&rsquo;s inaugural &ldquo;100 Most Creative People in Business.&rdquo; She also is the recipient of several patents for consumer electronics innovations."], "session_types": "keynote", "src": "genevievebell", "last": "Bell", "country": "au", "gender": "f", "organization": "Intel Labs", "first": "Genevieve", "job_title": "Anthropologist &amp; Researcher"}, "Rachel_Bolton-Nasir": {"website": "http://rabolton.com", "is_keynote": false, "class_name": "gender-f", "twitter": "boltonra", "safe": "Rachel-Bolton-Nasir", "prefix": "", "biography": ["Rachel Bolton-Nasir has worked as an experience architect and design researcher since graduating from Indiana University with a master&apos;s degree in Human-Computer Interaction Design. She&rsquo;s fascinated by people and passionate about improving their quality of life. Currently, she works at MISI Company, an experience design consultancy.", "In high school, she was lucky enough to study ceramics with Mr. Aiken, an amazingly talented and patient teacher. She continues to pursue her interest in sculpture, however feebly, in Brooklyn, NY."], "session_types": "presentation", "src": "rachelboltonnasir", "last": "Bolton-Nasir", "country": "us", "gender": "f", "organization": "Electronic Ink", "first": "Rachel", "job_title": "Design Researcher"}, "Michael_Hawley": {"website": "http://www.madpow.net", "is_keynote": false, "class_name": "gender-m", "twitter": "hawleymichael", "safe": "Michael-Hawley", "prefix": "", "biography": ["As the leader of the Mad*Pow Experience Design team, Michael leverages 15 years experience in the software industry and expertise in UX research, usability and information architecture to deliver value to clients such as Fidelity, GE, Autodesk and Monster. Michael holds his MS in Human Factors in Information Design from Bentley University, and a BA from the University of Michigan. Have an unique take on a design research or collaborative design method? Find Mike and tell him about it. He&apos;s a proponent of creative approaches to the user-centered design process and is a frequent presenter on alternative techniques."], "session_types": "presentation", "src": "michaelhawley", "last": "Hawley", "country": "us", "gender": "m", "organization": "Mad*Pow", "first": "Michael", "job_title": "Chief Design Officer"}, "Jonathan_Rez": {"website": "http://www.seren.com", "is_keynote": false, "class_name": "gender-m", "twitter": "jrez", "safe": "Jonathan-Rez", "prefix": "", "biography": ["Jonathan is a cross-disciplinary designer who develops engaging, user-friendly experiences and services within digital and built environments. Recently, he has been focusing on designing for mixed-reality experiences. A keen advocate for user centred design, he is interested in the interplay between design and cognitive psychology. Jonathan holds an MA in Narrative Environments Design. He is also a sessional lecturer at the University of New South Wales in Australia where he wrote the course Visual Identity in the Built Environment."], "session_types": "presentation", "src": "jonathanrez", "last": "Rez", "country": "uk", "gender": "m", "organization": "Seren Partners", "first": "Jonathan", "job_title": "Senior User Experience Consultant"}, "Matt_Morphett": {"website": "http://www.amberdew.com.au", "is_keynote": false, "class_name": "gender-m", "twitter": "mattmorphett", "safe": "Matt-Morphett", "prefix": "", "biography": ["Matt Morphett is a user experience consultant and interaction designer with strong management consulting experience. Matt has designed solutions for deployment within complex organisations and as part of sophisticated IT programs. Matt works in the analysis, design and evaluation of various forms of interaction between people and technology &#8211; including web-based systems, GUI applications, mobile devices and media rich solutions.", "Matt&rsquo;s clients have included Accenture, IBM, Cochlear, The National Film And Sound Archive, Eli Lilly, Scholastic and The Queensland Departments of Child Safety &amp; Communities."], "session_types": "presentation", "src": "mattmorphett", "last": "Morphett", "country": "au", "gender": "m", "organization": "Amberdew", "first": "Matt", "job_title": "Senior User Experience Designer"}, "Joshua_Sin": {"website": "http://www.joshsin.com", "is_keynote": false, "class_name": "gender-m", "twitter": "joshuasin", "safe": "Joshua-Sin", "prefix": "", "biography": ["Canadian designer Joshua Sin started his design career at Ontario College of Art and Design studying Industrial design and Sustainability. His passion in nature-inspired design led him to becoming a top ten finalist at the 2010 Toronto Green Innovation Awards where he presented his design theory and product: Morph. Since then, he joined Crispin Porter &amp; Bogusky as an Experience Designer. Working with clients such as Domino&rsquo;s Pizza and Microsoft, he hopes to fuse his knowledge in Biomimcry and design together to create future smart systems and ecosystems"], "session_types": "presentation", "src": "joshuasin", "last": "Sin", "country": "us", "gender": "m", "organization": "Crispin Porter + Bogusky", "first": "Joshua", "job_title": "Experience Design"}, "Matt_Nish-Lapidus": {"website": "http://blog.emenel.ca/", "is_keynote": false, "class_name": "gender-m", "twitter": "emenel", "safe": "Matt-Nish-Lapidus", "prefix": "", "biography": ["Matt Nish-Lapidus is a senior designer at Normative Design in Toronto. Matt&rsquo;s background in new media art, music, and design has enabled him to practice interaction design and related disciplines for over 10 years across a number of industries. He has worked for large clients such as Coca-Cola, as well as helped start-ups design and launch new products. Matt is currently serving on the board of directors for the Interaction Design Association (IxDA) and was a founder of IxDA Toronto."], "session_types": "workshop presentation", "src": "mattnishlapidus", "last": "Nish-Lapidus", "country": "ca", "gender": "m", "organization": "Normative Design", "first": "Matt", "job_title": "Senior Designer"}, "August_de los Reyes": {"website": "", "is_keynote": false, "class_name": "gender-m", "twitter": "augustdlr", "safe": "August-de-los-Reyes", "prefix": "", "biography": ["Designer, writer, and educator, August de los Reyes spent nearly eight years at Microsoft where, among other roles, he was Director of User Experience for Microsoft Surface. August holds an MDesS with Distinction from Harvard, is a fellow of the Royal Society of Arts, and sits on the national board of the Industrial Design Society of America. He divides his time between Puget Sound and the Bay Area."], "session_types": "presentation", "src": "augustdelosreyes", "last": "de los Reyes", "country": "us", "gender": "m", "organization": false, "first": "August", "job_title": "Design Director"}, "Arlene_Birt": {"website": "http://www.backgroundstories.com/", "is_keynote": false, "class_name": "gender-f", "twitter": "aBirt", "safe": "Arlene-Birt", "prefix": "", "biography": ["Arlene Birt is a visual storyteller, artist and information designer. Her work frames every-day actions within the con­text of the-big-picture in order to communicate consumers' roles in social and ecological sustainability.", "Arlene&apos;s work on sustainability –which rides the line between art and education– has been featured in Creative Review (UK), U.S. News and World Report, BusinessWeek.com, worldchanging.com, SEED Magazine, and at the Barcelona Design Museum. Arlene has received a Fulbright fellowship, a 2010 Art(ists) on the Verge fellowship, and numerous other grants. She holds a masters from Design Academy Eindhoven (NL) and teaches design techniques to communicate sustainability."], "session_types": "workshop", "src": "arlenebirt", "last": "Birt", "country": "be", "gender": "f", "organization": "Background Stories", "first": "Arlene", "job_title": "Visual Storyteller &amp; Info Designer"}, "Jonas_Löwgren": {"website": "", "is_keynote": true, "links": false, "class_name": "gender-m", "twitter": "", "safe": "Jonas-Löwgren", "prefix": "", "session_types": "keynote", "src": "jonaslöwgren", "last": "Löwgren", "country": "se", "gender": "m", "organization": "School of Arts & Communication at Malmö University", "first": "Jonas", "job_title": "Co-founder &amp; Professor of Interaction Design"}, "Ryan_Betts": {"website": "", "is_keynote": false, "class_name": "gender-m", "twitter": "hitsmachines", "safe": "Ryan-Betts", "prefix": "", "biography": ["Ryan Betts is an interaction designer at Nitobi Software, creators of PhoneGap. He holds a BSc in Interaction Design from Simon Fraser University, where he is still involved as a guest lecturer and mentor. Presently focused on designing and developing for mobile phones and tablets, he is very excited about the future of urban computing. He is also a regular contributor to UX Mag and co-coordinator of the mapping work group for the Vancouver Public Space Network.", "In his spare time, he really loves to drum; his favorite groove is the Purdie shuffle."], "session_types": "presentation", "src": "ryanbetts", "last": "Betts", "country": "ca", "gender": "m", "organization": "Nitobi Software Inc.", "first": "Ryan", "job_title": "Interaction Designer"}, "Sara_Summers": {"website": "http://www.uxarray.com", "is_keynote": false, "class_name": "gender-f", "twitter": "ssummers", "safe": "Sara-Summers", "prefix": "", "biography": ["Sara Summers is a User Experience Evangelist at Microsoft, living in Austin, TX. She coauthored a book for experience designers, entitled Dynamic Prototyping and has a personal design mantra: happy, healthy designers and developers working and playing together to create beautiful, inspirational products. Sara loves to talk about big ideas, changing everything, breaking your toys, throwing away your designs and capturing new ideas. Sara reads everything she can get her hands on and prides herself in being an armchair social and cognitive scientist and researcher. Academically, she is trained as a technologist and visual designer, with a BS in Computer Graphics Technology, from Purdue University."], "session_types": "sponsored-workshop", "src": "sarasummers", "last": "Summers", "country": "us", "gender": "f", "organization": "Microsoft", "first": "Sara", "job_title": "User Experience Evangelist"}, "Lis_Hubert": {"website": "http://www.elisabethhubert.com", "is_keynote": false, "class_name": "gender-f", "twitter": "lishubert", "safe": "Lis-Hubert", "prefix": "", "biography": ["Lis is an independent consultant in the User Experience field with extensive experience in website strategy design, interaction design and information architecture. She works with clients on many different levels ranging from Fortune 500 businesses to startups. Most recently Lis had the opportunity to work with Moment Design on the creation of a high profile sports and entertainment iPad application, redesign of their sports &amp; entertainment client, as well as additional site redesigns and updates. In order to stay active and contribute to the user experience community, Lis volunteers as a local leader for the IxDA New York City chapter."], "session_types": "presentation", "src": "lishubert", "last": "Hubert", "country": "us", "gender": "f", "organization": "Independent", "first": "Lis", "job_title": "User Experience Consultant"}, "Kars_Alfrink": {"website": "http://whatsthehubbub.nl", "is_keynote": false, "class_name": "gender-m", "twitter": "kaeru", "safe": "Kars-Alfrink", "prefix": "", "biography": ["Kars is &lsquo;Chief Agent&rsquo; of Hubbub, a networked design studio for applied pervasive games. Hubbub works with organizations to create games that take place in public space, engage people physically, and are socially relevant. Amongst other things, these games are used to encourage good citizenship and to facilitate cultural participation.", "In addition, Kars teaches at the Utrecht School of the Arts, where he mentors students pursuing a master of arts in interaction design or game design &amp; development.", "He&apos;s also the initiator and co-organizer of &lsquo;This Happened&rsquo; &#8211; Utrecht, a series of lectures dedicated to the stories behind interaction design."], "session_types": "presentation", "src": "karsalfrink", "last": "Alfrink", "country": "nl", "gender": "m", "organization": "Hubbub", "first": "Kars", "job_title": "Chief Agent"}, "Julie_Baher": {"website": "http://www.citrix.com", "is_keynote": false, "class_name": "gender-f", "twitter": "", "safe": "Julie-Baher", "prefix": "", "biography": ["Julie has a Ph.D. from Northwestern University in Learning Sciences &#8211; an interdisciplinary program of cognitive science, artificial intelligence and education. She is Director of Product Design at Citrix for Cloud products. Most recently, she was at Adobe where she was a Senior User Experience Manager for the Adobe Creative Suite. Prior to Adobe, she worked at Xerox doing both interaction design and user research for Xerox.com. In the go-go .com days she was Director of User Experience at UNext (working for Don Norman) where they built an online MBA program (ellis.nyit.edu)."], "session_types": "presentation", "src": "juliebaher", "last": "Baher", "country": "us", "gender": "f", "organization": "Citrix", "first": "Julie", "job_title": "Director of Product Design"}, "Kate_Ertmann": {"website": "http://www.animationdynamics.com", "is_keynote": false, "class_name": "gender-f", "twitter": "goK8", "safe": "Kate-Ertmann", "prefix": "", "biography": ["Kate Ertmann is a businesswoman, speaker, thought leader and a charitable advocate. A former child actress, she renounced her Hollywood hopes in favor of a telecommunications degree from Ohio University. She founded the Portland chapter of Women in Animation and is an active member of many industry organizations. She sits on the board of two charities and won a 2011 Orchid Award for being one of Portland&rsquo;s Most Influential Women for her work. Kate became a partner at ADi in 2000 and the sole owner in 2008 &#8211; her company produces innovative 3d animation solutions for business, marketing and education."], "session_types": "presentation", "src": "kateertmann", "last": "Ertmann", "country": "us", "gender": "f", "organization": "Animation Dynamics", "first": "Kate", "job_title": "Owner"}, "Amber_Case": {"website": "http://about.me/caseorganic", "is_keynote": true, "class_name": "gender-f", "twitter": "caseorganic", "safe": "Amber-Case", "prefix": "", "session_types": "keynote", "src": "ambercase", "last": "Case", "country": "us", "gender": "f", "organization": false, "first": "Amber", "job_title": "Cyborg Anthropologist &amp; User Experience Designer"}, "Jon_Kolko": {"website": "http://www.thinktiv.com", "is_keynote": false, "class_name": "gender-m", "twitter": "jkolko", "safe": "Jon-Kolko", "prefix": "", "session_types": "workshop", "src": "jonkolko", "last": "Kolko", "country": "us", "gender": "m", "organization": "Thinktiv, Austin Center for Design", "first": "Jon", "job_title": "Executive Director"}, "Sam_Smith": {"website": "http://www.rma-consulting.com", "is_keynote": false, "class_name": "gender-m", "twitter": "pub", "safe": "Sam-Smith", "prefix": "", "biography": ["I work for RMA Consulting as a UX Consultant. We build \"day in, day out\" (DIDO) applications &#8211; apps that allow users to master complex data and harness it for action as part of their daily working lives. Prior to RMA I spent 10 years working in design/UX roles, at agencies (including the Team, Freestyle Interactive and Digitas) and client-side (Rightmove.co.uk and The University of Birmingham). When I&apos;m not filling sketchbooks with ideas, I&apos;m up to my elbows in clay (sculpting) or reflecting on how lucky I am that I get to do a job that I love."], "session_types": "workshop", "src": "samsmith", "last": "Smith", "country": "uk", "gender": "m", "organization": "RMA Consulting", "first": "Sam", "job_title": "User Experience Consultant"}, "Søren_Muus": {"website": "http://www.fatdux.com", "is_keynote": false, "class_name": "gender-m", "twitter": "sorenmuus", "safe": "Søren-Muus", "prefix": "", "biography": ["Søren is a co-founder of FatDUX along with Thomas Snitker and Eric Reiss, focusing entirely on designing, developing, and deploying great user experiences for clients in both Europe and North America.", "Søren began his career in the mid-eighties as an Art Director in various agencies, where he specialized in brand development. From the mid-nineties he has practiced interaction design, both on and offline. Today he is Chief Creative Director at FatDUX Copenhagen.", "Søren is active in the IxD community, is a founding member of European Centre for User Experience, and a member of IAI, UPA, and UX Group Denmark."], "session_types": "presentation", "src": "sørenmuus", "last": "Muus", "country": "dk", "gender": "m", "organization": "FatDUX", "first": "Søren", "job_title": "Chief Creative Director"}, "Rachel_Hinman": {"website": "http://www.rachelhinman.com", "is_keynote": false, "class_name": "gender-f", "twitter": "hinman", "safe": "Rachel-Hinman", "prefix": "", "biography": ["Rachel Hinman is a researcher, designer and a recognized thought leader in the mobile user experience field. Currently, she is a Senior Research Scientist at the Nokia Research Center in Palo Alto, California. There she focuses on the research and design of emergent and experimental mobile interfaces and mobile experiences for emerging markets.", "Prior to joining Nokia, Rachel was and experience design director at Adaptive Path, and a mobile researcher and strategist for Yahoo&rsquo;s mobile group. Currently, Rachel is writing The Mobile Frontier: A Guide for Designing Mobile User Experiences with Rosenfeld Media."], "session_types": "workshop presentation", "src": "rachelhinman", "last": "Hinman", "country": "us", "gender": "f", "organization": "Nokia", "first": "Rachel", "job_title": "Senior Research Scientist"}, "Des_Traynor": {"website": "http://intercom.io", "is_keynote": false, "class_name": "gender-m", "twitter": "destraynor", "safe": "Des-Traynor", "prefix": "", "biography": ["I&apos;m an experienced interaction designer, with a passion for designing delightful web software. While working with Contrast, I designed web applications for many start-ups and have seen all possible outcomes from profitable businesses to crash and burns.", "I write regularly about the challenges of being a UX designer in a start-up world, and my posts can be found on the Intercom blog, which succeeded the Contrast blog. I speak regularly at start-up an design events, about topics ranging from customer acquisition through to info-graphic design.", "Prior to working as a consultant I spent 3 years lecturing software engineering and publishing papers in the area of computer science education."], "session_types": "presentation", "src": "destraynor", "last": "Traynor", "country": "ie", "gender": "m", "organization": "Intercom", "first": "Des", "job_title": "User Experience Lead &amp; Chief Operating Officer"}, "Dustin_DiTommaso": {"website": "www.madpow.net", "is_keynote": false, "class_name": "gender-m", "twitter": "DU5TB1N", "safe": "Dustin-DiTommaso", "prefix": "", "biography": ["Dustin DiTommaso has spent nearly a decade chasing the perfect blend of form, function and meaning while designing mobile and social applications, multi-channel experiences, games, game layers and customer engagement models. He currently tackles wicked problems as an Experience Design Director at Mad*Pow.", "Dustin&rsquo;s work has been recognized by Yahoo!, Macworld, MITX, New York Festivals and the Boston Phoenix. He has also taught advanced typography and publication design at the Chamberlayne School of Design and is an active member and lecturer in a number of industry communities."], "session_types": "presentation", "src": "dustinditommaso", "last": "DiTommaso", "country": "us", "gender": "m", "organization": "Mad*Pow", "first": "Dustin", "job_title": "Experience Design Director"}, "Dan_Lockton": {"website": "http://danlockton.co.uk", "is_keynote": false, "class_name": "gender-m", "twitter": "danlockton", "safe": "Dan-Lockton", "prefix": "", "biography": ["Dan specialises in design for behaviour change—influencing behaviour for social and environmental benefit, through the design of products, services and environments. The Design with Intent toolkit, arising from his PhD at Brunel, is an interaction design pattern library bringing together behavioural insights and examples into a form (hopefully) useful for designers.", "At present Dan&apos;s a research fellow at WMG, University of Warwick, on Empower, a collaboraton with More Associates which aims to reduce workplace energy use through connecting people with energy and behavioural data in engaging ways. He teaches environmentally sensitive design on Brunel&apos;s product design courses, and also does consultancy as Requisite Variety.", "In the past, Dan&apos;s worked in R&amp;D for Sir Clive Sinclair, built some unusual folding bikes, and written a book on the Reliant Motor Company."], "session_types": "workshop", "src": "danlockton", "last": "Lockton", "country": "uk", "gender": "m", "organization": "University of Warwick & Brunel University", "first": "Dan", "job_title": "Research Fellow &amp; Lecturer in Design"}, "Tom_O'Rahilly": {"website": "http://www.leprechaunmuseum.ie", "is_keynote": false, "class_name": "gender-m", "twitter": "leprechaunmuseum_ie", "safe": "Tom-O'Rahilly", "prefix": "", "biography": ["I have a background in Product Design. Working in this field I became very interested in how people experienced our products and projects and how they remembered their experiences. For 10 years I designed and produced furniture and lighting with exhibitions in NY, London and Paris. I worked with workshops throughout Europe to deliver high quality projects for a wide range of demanding clients. I enjoyed realizing concepts in complex environments. In 2008 I started a project exploring imagination and identity. The Leprechaun Museum opened in March 2010."], "session_types": "presentation", "src": "tomorahilly", "last": "O'Rahilly", "country": "ie", "gender": "m", "organization": "National Leprechaun Museum", "first": "Tom", "job_title": "Director"}}
